{"40396679": {"Description": " DESCRIPTION Alexa Shopping Spoken Language Understanding team is looking for a senior data scientist to join a recently established team in London. The team’s mission is to ‘put the customer in the loop’ to improve the shopping experience on Alexa. The team will be  building systems to collect and use explicit and implicit signals from customer behavior. As the lead scientist on the team you will drive the investigation to make this data actionable. You will have considerable scope to direct the research to find the maximum  impact. This could include identifying leading indicators of customer dissatisfaction, using customer provided signals to improve existing Alexa language understanding models or operationalizing entirely new models to improve the experience for our customers.This is a blue-sky role that gives you a chance to roll up your sleeves and dive into big data sets in order to build simulations and experimentation systems at scale, build optimization algorithms and leverage cutting-edge technologies across Amazon. This  is an opportunity to think big about how to interpret the behavior of our customers and improve the voice shopping experience.You will work closely with product and technical leaders throughout Alexa Shopping and will be responsible for influencing technical decisions in areas of development/modelling that you identify as critical future product offerings. You will identify both enablers  and blockers of adoption for product understanding, and build programs to raise the bar in terms of understanding product questions and predict the shaping of customer utterances as we move from simple to complex utterances.The ideal candidate will have extensive experience in Science work, business analytics and have the aptitude to incorporate new approaches and methodologies while dealing with ambiguities in sourcing processes. Excellent business and communication skills are  a must to develop and define key business questions and to build data sets that answer those questions. You should have a demonstrated ability to think strategically and analytically about business, product, and technical challenges. Further, you must have  the ability to build and communicate compelling value propositions, and work across the organization to achieve consensus. This role requires a strong passion for customers, a high level of comfort navigating ambiguity, and a keen sense of ownership and drive  to deliver results.Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation ", "Salary": "£90,000 - £120,000 per annum", "Location": "London", "Contract": "Contract, full-time"}, "40583658": {"Description": " DESCRIPTION Are you looking to work at the leading edge of advanced Machine Learning and Artificial Intelligence in healthcare and research?As a member of of the AWS EMEA Public Sector Healthcare Data Science team, you'll partner with our customers and AWS technology and business teams to help transform research, health and social care using AI and Cloud technologies.Example focus areas include Genomics, Clinical Decision Support, Population health and health system productivity.You will be working with terabytes of text, images, and other types of data to solve real-world problems. You'll develop novel use cases, design and run projects, research new algorithms, and find new ways of helping to improve clinical outcomes, productivity  and research using cloud.The primary responsibilities of this role are to:· Work with sales, business development and solution architecture teams to design and develop innovative solutions to healthcare customer needs· Use deep learning, machine learning and analytical techniques to create scalable solutions to address healthcare needs· Interact with customers directly to understand business challenges, develop use cases and solutions and help customers implement DL/ML algorithms and cloud technologies to solve problems· Analyze and extract relevant information from large amounts of historical data to help automate and optimize key processes· Work closely with account teams, research and product engineering teams to drive model implementations and new algorithmsThis position requires travel of up to 50%. ", "Salary": "£35,000 - £75,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40568555": {"Description": " Data ScientistLondon (Zone 1)£65,000 - £75,000THE COMPANYHarnham are currently partnering with a global tech company who are currently hiring for a Data Scientist to join the business.  You will join a global team of Data Scientists, Engineers and Analysts spread across London, San Francisco, and Stockholm.  Your role will be to use advanced techniques to help improve product performance across the business and understand over 100mn customers globally.  THE ROLEYou will be expected to:  Work on a variety of projects related to customer behaviour, revenue optimisation, marketing effectiveness and campaign analysis. Collaborate closely with research, product and commercial teams to deliver machine learning at scale.Conduct A/B tests to help improve understanding of user behaviourIntroduce new and interesting ways to work with data to keep the business at the forefront of innovation within data science.Play a key role in helping the business deliver on their commercial goals through the use of data science. YOUR SKILLS AND EXPERIENCEYou must have:  An MSc or Ph.D. in a quantitative discipline (e.g. statistics, physics, mathematics)Experience in using machine learning and statistical models to improve product performanceEnd to end problem solving experienceStrong knowledge of Python and SQL THE BENEFITS~ £75,000 + BenefitsHOW TO APPLYPlease register your interest by sending your CV via the Apply link on this page. For more information about this role, or similar machine learning positions, please get in touch with Nick Mandella at Harnham. KEYWORDSPython, SQL, Machine learning, statistical modelling, A/B test, MVT, data scientist, data science, customer behaviour, marketing analytics.  ", "Salary": "£55,000 - £60,000 per annum", "Location": "London", "Contract": "Contract, full-time"}, "40456690": {"Description": "Data Scientist - 3 months - West London Global FMCG is looking an experienced Data Scientist to support the commercial organisation in harnessing advanced analytics to drive business performance.The Data Scientist will be accountable for driving the development of advanced analytical models to solve challenging business problems. The individual will work with multi-disciplinary teams to understand the needs of the business and ensure that model outputs are translated into actionable business insights. This is a hands-on role and the successful candidate will be comfortable working in an agile environment and capable of leading delivery at pace.Key Responsibilities: - Contribute to a culture of agility and close partnership with the business to ensure timely delivery against critical priorities. - Partner with leaders in the analytics team and from across the business to understand key business challenges / questions which can be addressed using advanced analytics - Apply a broad array of modelling skills including driver analysis, machine learning and traditional statistics, to extract insights from structured and unstructured data sources. This information will also need to be integrated with complementary real-world  & digital information streams to address business challenges (e.g. Multi-Channel Analytics, Patient Pathways, Omni-Channel Segmentation, Territory Design, Next Best Action) - Actively participate and able to project manage in all stages of model development from data collection, data quality control, model building, model validation, testing and calibration. - Collaborate with teams in multiple locations for some complex analyses. - Continually learn new analytical skills, techniques and tools to maximise competitive advantage; participate in internal & external technology communities - Communicate technical subject matter clearly and concisely to audiences of various backgrounds - Provide input on the data architecture and be a contributor to the data governance framework - Provide guidance to offshore data scientists and data engineers * Partner with external agencies as needed- String Python skills are required Spring Technology acts as an employment agency for permanent recruitment and an employment business for the supply of temporary workers. The Spring Group UK is an Equal Opportunities Employer.By applying for this role your details will be submitted to Spring. Our Candidate Privacy Information Statement explains how we will use your information - please copy and paste the following link in to your browser: candidate-privacy-information-statement", "Salary": "Salary negotiable", "Location": "London", "Contract": "Permanent, full-time"}, "40573533": {"Description": " DATA SCIENTIST -£450-£550 PER DAY1 MONTH INITIALLY REMOTE/ LONDON BASED As a Data Scientist creating a prototype for a new ML based product you will be using Python heavily alongside Plotly, specifically Dash to create powerful visualisations. THE COMPANY:  You will be working for a dynamic tech focused company. As a Data Scientist you will be working alongside more junior Data Scientists & Data Engineers in spearheading the use of Dash. You will be working in an agile and fast paced environment. THE ROLE:  As a Data Scientist, you will be coding in Python. It is imperative that you have extensive experience with Python and its basic ML packages. As a Data Scientist you will be focusing on applying ML systems for business critical requirements. This will be  using Plotly specifically Dash therefore you must have commercial experience with this and be able to demonstrate your expertise. As a Data Scientist you will be working in a GCP environment so experience within this platform and features such as Kubeflow  and Composer is valuable. They are looking for an individual who enjoy working in fast paced, dynamic and collaborative environment. YOUR SKILLS AND EXPERIENCE:  The successful Data Scientist will have the following skills and experience:  Extensive experience with Python and ML packages Commercial experience with Plotly, specifically DashWorked in a GCP environment  THE BENEFITS:   A chance to work in a highly dynamic environment  HOW TO APPLY:  Please register your interest by sending your CV to Anna Greenhill via the Apply link on this page. ", "Salary": "£65,000 - £75,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40349423": {"Description": " Data Scientist  Asset ManagementLondon£60,000 + Bonus THE COMPANY This is a unique chance to join a brand new team being set up in a leading asset management firm based in London. You will be a key member brought in to build a team who will focus on building data science products to support the wider business, everything from sales functions to internal investment processes. You will have the remit to build something which has never been done in the industry, as well as work with a great team of data scientists, engineers and analysts! THE ROLE You will be:  Utilising advanced analytics to build products and internal tools for the wider businessBuild an internal recommendation system to generate and keep business.Using data science techniques to understand customer behaviour and marketingLiaising with senior stakeholders Delivering effective analytics and visualisations for internal use YOUR SKILLS AND EXPERIENCE You must have:  An MSc in a statistical or engineering degreeExperience in programming languages such as R or PythonExperience in SQL is beneficialA proven track record of delivering business insights and supporting strategic decisions through the use of data scienceA can-do attitude and a passion for solving a range of complex problems with data! THE BENEFITS £60,000 + Benefits (including bonus) HOW TO APPLY Please register your interest by sending your CV via the Apply link on this page. KEYWORDS Python, R, SQL, Data Science, Data Scientist, Machine Learning.  ", "Salary": "£60,000 - £75,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40449545": {"Description": " Do you want to work for an innovate AI Automotive startup?The company work solely in machine learning automation for automotive and logistics companies. They have recently won sever large contracts with well renowned automotive companies to deploy computer vision and highly advance analytical solutions.To meet this demand they are hiring 2 machine learning developers / data scientists to join the team. You will be offered full training on their current suite of bespoke software and given a clear progression plan from day one.This company is all about practical and 'productionisable' code which is used in the real world. Responsibilities- Applying practical machine learning techniques to a pipeline of raw and derived data from various platforms.- Responsible for designing and delivering a suite of machine learning-based perception / computer vision algorithms.- Keep up to date with the latest literature and help the team to assess new techniques and their suitability.What you will need- Coding experience with C++ / MATLAB, Python- Exposure to ROS - Robot Operating System- Experience with Computer Vision algorithms- An interest in the automotive space!- Education - they are flexible but ideally looking for MSc or PhD in Computer Vision / Robotics etcRole: Data Scientist / Machine Learning EngineerSalary: £25k - £45k DOELocation: West LondonWork from home: 100% during COVID & flexible thereafter Modis International Ltd acts as an employment agency for permanent recruitment and an employment business for the supply of temporary workers in the UK. Modis Europe Ltd provide a variety of international solutions that connect clients to the best talent  in the world. For all positions based in Switzerland, Modis Europe Ltd works with its licensed Swiss partner Accurity GmbH to ensure that candidate applications are handled in accordance with Swiss law. Both Modis International Ltd and Modis Europe Ltd are Equal Opportunities Employers. By applying for this role your details will be submitted to Modis International Ltd and/ or Modis Europe Ltd. Our Candidate Privacy Information Statement explains how we will use your information - please copy and paste the following link in to your browser:  http://en-gb/candidate-privacy ", "Salary": "£40,000 - £60,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40527404": {"Description": " ***Data Scientist - Ltd Contract - Remote/London***Data Scientist6 Month Rolling ContractRemote (Office is London)£Competitive Ltd CompanyMy client is a blue chip FMCG and retail brand that serve millions of customers every week from all over the globe. With over 6,000 stores internationally my client are a well known household name that offer a number of exciting opportunities. Our Data Science team focuses on modelling complex business problems and deploying data products at scale. Our work spans across multiple areas including physical stores, online, supply chain, marketing and Clubcard, where we encourage rotation amongst our  Data Scientists so they can gain expertise in different subjects. We work on several domains and problem types: online, pricing, security, fulfilment, distribution, property, IoT and computer vision are just some. Our team members spend 10% of their week on learning and personal development. Multiple academic collaborations  enrich the team expertise; knowledge sharing events are regular. Furthermore, we have got a great work-life balance, team days and relaxed but engaging culture. ROLE DESCRIPTIONThis is a hands-on position where you will need to leverage your analytical mindset to find solutions to complex problems. As a Data Scientist, you will need to understand difficult business problems and prototype solutions with minimal support. Apply, modify  and design algorithms and mathematical models to solve business problems on top of big data architectures (Hadoop, Spark) is a core component of the role. Our data scientists will need to be able to validate, document and present the modeling process and performances, as well as communicate complex solutions in a clear, understandable way to non-experts.CANDIDATE DESCRIPTION We are looking for ambitious individuals with a mix of statistics, programming and machine learning skills. The role requires that you have an extensive background in machine learning and data mining. A track record in modifying and designing advanced algorithms  and applying them to large data sets is essential. An ideal candidate will have a scientific mentality with the ability to ask the right questions, as well as answer them. A strong numerical higher degree in a mathematical, scientific, engineering or computer science discipline is preferable, as well as a solid  understanding of mathematics and statistical principles. Experience in one or more of the following fields is required:· Predictive modelling· Operational research· Deep learning and time series modelling· Finally, strong programming experience (Python is preferred) ", "Salary": "£50,000 - £70,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40532972": {"Description": " Data Scientist£75,000 - £80,000London THE ROLE Harnham are currently working with an award-winning InsureTech start-up who are currently earning a lot of recognition for their work, and revolutionising their industry whilst they do it! As a business they focus their efforts on real-time machine learning for the good of the customer.  You will join as a key member of the team and work closely alongside both Data Scientists and Engineers to develop a market-leading product. SKILLS AND EXPERTISE You will:  Build cutting-edge machine learning models which will be deployed and run in real-timeHave a huge variety of very rich data to work withWork with Python, PySpark, AWS, KubernetesHave a passion for deploying robust and scalable AI solutionsHave an interest in working closely with engineers, helping to drive the companies \"build\" mentality! HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Nick Mandella at Harnham. SALARY You can earn up to £80,000 + Options. KEYWORDS Python, Pyspark, spark, kubernetes, SQL, AWS, Machine Learning, Data Scientist, Data Science, ETL, Engineering, Scalable solutions, deployment.  ", "Salary": "£50,000 - £55,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40460620": {"Description": " Data Scientist THE COMPANY Data Idols are working with a well know online brand to find an experienced Data Scientist. They are rapidly expanding their data teams across all areas due to their huge growth. THE ROLE Within this Data Scientist role, you will be developing and implementing custom algorithms to be used throughout the business and run optimisations to achieve commercial objectives and spot market opportunities. As an experienced Data Scientist you will:  Researching deep learning and NLP algorithms for the businessWorking closely with the data teamBuilding data-driven products for the business YOUR SKILLS AND EXPERIENCE  Experience working with large volumes of dataA strong understanding of Machine LearningKnowledge and commercial experience using Python, R and SQLMSc/Ph.D. in relevant field This is an outstanding opportunity to join an exciting company on a permanent basis with a great salary and benefits package. Please submit your CV for consideration. Data Scientist  ", "Salary": "£70,000 - £140,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40573407": {"Description": " Data Scientist  London FinTech Up to £70,000 + Benefits This is a fantastic opportunity to join an innovative fintech company within their advanced analytics team, giving you the ability to advance your data science skills. This is an excellent opportunity for an analyst with experience using SQL, R or Python,  to develop their skills in advanced analytics techniques. Duties and Responsibilities - Data Scientist  Design, plan and execute the targeting of customers through the company's targeted marketing programmeCreate and establish advanced customer analytics - e.g. segmentation, cohort analysis and customer retentionUsing statistical modelling methodologies to solve queries and optimise the marketing mixManage and conduct regular post campaign analysis, delivering actionable insights and recommendations using tools such as SQL, R and Python Skills and Qualifications - Data Scientist  University degree in a numerate discipline - ideally mathematics, statistics, engineering etcExperienced user of SQL and Python - specifically modellingPrior experience within B2C product analytics, ideally having carried out A/B testsStrong commercial awareness and ability to interact with various internal and external stakeholdersAbility to carry out a senior role within the team, as well as working independently to meet tight deadlinesWilling to learn new frameworks and languages as needed Salary and Benefits - Data Scientist Up to £70,000 + Benefits How To Apply - Data Scientist Please register your interest by submitting your CV via the apply link on this page. Key Words: SQL, R, Python, Data Scientist, Insight Analysis, Customer Insight, Customer Behaviour, Loyalty Analytics, Commercial Insight, Marketing Insight, Marketing Analytics, Segmentation, Clustering, Cluster Analysis, Regression, Propensity, Statistics, Statistical,  Statistical Modelling, Modelling, London ", "Salary": "£40,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40532757": {"Description": " Data Scientist Up to £75,000 + Benefits London The Company  Join a leading telecoms company who are looking to transform themselves into one of the best technology companies globally with data at the forefront of operations  The RoleAs a data scientist you will be responsible for developing end to end predictive models  Role and Responsibilities:   Develop machine learning and AI models that are scaled across multiple markets Providing commercially viable applications using deep/reinforced learning techniques Developing progressive analytic algorithms through exploiting rich data assets Skills and Requirements:  To qualify for this Data Scientist role, you will need:  Advanced analytics and programming for models through PythonExpertise in SQL/data manipulation skills required including cleaning and managing data.Commercial experience building a variety of machine learning models  HOW TO APPLY: Please register your interest by sending your CV to Sean via the Apply link on this page. ", "Salary": "£90,000 - £95,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40502659": {"Description": "Data Scientist - 11 month contract - £320 per dayOverview An excellent opportunity has arisen with a Global Leader in Social Media for a talented and enthusiastic Data Scientist.The role ·Construct predictive models, algorithms and probability engines to support data analysis or product functions ·Design experiments and methodologies to generate and collect data for business use.·Use advanced mathematical and statistical concepts and theories to analyse and collect data and construct solutions to business problems. ·Perform complex statistical analysis on experimental or business data to validate and quantify trends or patterns identified by business analysts.Requirements:·2 years of relevant work experience ·Experience applying advanced analytics to business problems Proficiency in SQL ·Experience with Python or R, as well as big data systems such as Hive Understanding of key user life cycle concepts (acquisition, engagement, retention, monetisation) ·Experience with funnel analysis and A/B tests.·Excellent problem-framing, problem-solving and project management skills.·Experience framing and articulating important product questions, selecting the right statistical tools and visualisations to obtain answers from data, translating them into business recommendations ·Experience working with cross functional teams: product managers, engineers, researchers, marketers.Education:·BSC degree in a quantitative discipline ·Excellent communication skills: written, verbal, PowerPoint presentations.Data Scientist - 11 month contract - £320 per day", "Salary": "£80,000 per annum", "Location": "London", "Contract": null}, "40483213": {"Description": " Data Scientist ** DIGITAL SOFTWARE PROVIDER ** LOCATION - North London SALARY - £40k - £60k plus strong benefits Did you love Hornby Model Railways when you were a kid - remember the advert?!Or perhaps you enjoy all things travel, transport and trains?Or maybe you have no interest in either but just LOVE getting your data science brain engaged in something truly unique and challenging?Then read on - as this role would suit a truly curious mind, with the ability to shape cutting edge solutions for the UK’s travel networks. You will be creating brand new, never been seen before data driven products and ways of working for controllers across  our nation. Working in a growing team of Data Scientists and Data Engineers, you will reporting into the Head of Data, using your skills in automation through machine learning, advanced statistical analysis and modelling to create a single source of truth, which in  turn can allow for predicting disruption, forecasting risk to rail operators and many other variables. Data is collected from signalling software (both real time and historical) and used to aid decisioning, with this company adding unique value through their  'world first’ embedded intelligence, whereby they integrating their products with tools used by the control rooms. Technically they operate a Python environment, so we are seeking people with advanced knowledge of this tool, ideally, but R will be considered. This niche industry offers huge amounts of potential for the use of creative, advanced machine learning and analytical approaches, with valuable insights being used to improve the UK’s rail network’s efficiency, safety and in turn commuter experiences. Your  intellectual curiosity and problem solving approach will be utilised in an ever evolving business, which has already set it’s self apart from global giants within the transport management software industry such as Hitachi and Talo, through innovation and agility. A unique opportunity to diversify your skills in a different industry with lots of growth opportunity and a chance to really test those brain cells! EXPERIENCE REQUIRED  Educated to at least degree level in a numerate subject such as Machine Learning, Computer Science, Mathematics, Statistics, Engineering, Physics, Chemistry etc.Experience in bringing insights to life, derived through advanced analytics and modelling, helping to improve decision making and building out data led solutions and productsStrong experience of Python or R for automation, machine learning, advanced statistical analysis and modellingIdeally experience and/or an interest in the transport industry, but not essentialHigh attention to detailGood communication skills, written, verbal, etc. TO APPLYFor further information or to apply please contact:Kate McDermott - Managing Consultant @ Blue Pelican Marketing Share through your CV to  Text me on Share through your LI profile if you’re non-active and simply curious You don’t have to have a CV to find a new job! We’re always keen to talk to good data experts.For more vacancies which may suit your needs, please visit us at www.bluepelican.com ", "Salary": "£80,000 - £110,000 per annum", "Location": "London", "Contract": null}, "40502398": {"Description": " Lead Data Scientist - FinTech We have an amazing opportunity to join a startup FinTech business, and be the first founding Data Scientist within the business which will allow a huge scope to scale this area out within the business. This is a very financially well backed with large plans,  looking to add to the disruption within the financial services space. The Co-Founders ex-silicon valley and have a strong track records or building successful tech teams. You will be spearheading the design and implementation of solutions created via the Data Science platform. Developing innovative algorithms and data models to gain real insight into consumer financial data to make a real difference to customers. They are looking for someone with a background in: ·Designing and building machine learning algorithms ·Coding in Python, Java or R ·Working with large data sets - data extraction, cleansing, analysis and presentation ·Familiarity with relational SQL databases and NoSQL databases ·XML and related technologies ·Cloud Infrastructure (AWS, Azure or GCP) ·MsC or PhD education in relatable field - Statistics, Computer Science, Data Science, Mathematics It would be very useful if you had the following experience but not essential: ·Leveraging big data technologies on Hadoop platforms ·Working for a FinTech / Challenger Bank There is a very strong package on offer, including equity within the business. If being involved at an early stage and really having ownership and freedom to deliver Data Science solutions sounds interesting, then please do apply! This job ad was posted by Salt. To find out more about Salt's Privacy Policy and how your application is processed, please visit our website https://privacy-policy/. ", "Salary": "£35,000 - £75,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40598389": {"Description": " Product Data Scientist London From £50,000-£75,000 depending on experience An innovative FinTech who have received millions in funding over the last year are seeking to expand their Data Science function. This brand have a product that helps their customers better manage their money and they now have millions of customers globally.  You will work on advanced data science products, help the C-Suite understand customer insight and commercial analytics.  If you are technically savvy in SQL and Python, with the ability to analyse millions of rows of customer data to create commercial insights for a business and increase marketing effectiveness, then this could be the next step in your career. Product Data Scientist  Daily use of SQL and Python with a focus on building statistical models (machine learning, churn, regression, propensity, attribution)Analysing the performance of products and analysing marketing trends to inform business strategies Delivering insights and recommendations to diverse stakeholders both internally and externally on how to increase performance, conversion and product diversificationYou will work on digital projects as well including A/B testingYou will work on customer retention and acquisition strategiesYou will present visualisations on Tableau  You don't have to tick all of the boxes but some of the following would be relevant:  You will have commercial experience in SQL, Python and product analyticsYou will have experience within customer insight and marketing functionsIdeally you will have experience analysing customer, transactional and/or online data  Salary and Benefits The successful candidate can expect to earn up to £70,000! In addition, they have one of the best discretionary bonus systems in the industry, a healthcare package, flexible hours and numerous team benefits e.g. socials and sports clubs. ", "Salary": "£65,000 - £95,000 per annum", "Location": "London", "Contract": "Contract, full-time"}, "40586704": {"Description": " Product Data Scientist London From £50,000-£70,000 depending on experience An innovative FinTech who have received millions in funding over the last year are seeking to expand their Data Science function. This brand have a product that helps their customers better manage their money and they now have millions of customers globally.  You will work on advanced data science products, help the C-Suite understand customer insight and commercial analytics.  If you are technically savvy in SQL and Python, with the ability to analyse millions of rows of customer data to create commercial insights for a business and increase marketing effectiveness, then this could be the next step in your career. Product Data Scientist  Daily use of SQL and Python with a focus on building statistical models (machine learning, churn, regression, propensity, attribution)Analysing the performance of products and analysing marketing trends to inform business strategies Delivering insights and recommendations to diverse stakeholders both internally and externally on how to increase performance, conversion and product diversificationYou will work on digital projects as well including A/B testingYou will work on customer retention and acquisition strategiesYou will present visualisations on Tableau  You don't have to tick all of the boxes but some of the following would be relevant:  You will have commercial experience in SQL, Python and product analyticsYou will have experience within customer insight and marketing functionsIdeally you will have experience analysing customer, transactional and/or online data  Salary and Benefits The successful candidate can expect to earn up to £70,000! In addition, they have one of the best discretionary bonus systems in the industry, a healthcare package, flexible hours and numerous team benefits e.g. socials and sports clubs. ", "Salary": "Salary negotiable", "Location": "London", "Contract": "Permanent, full-time"}, "40572991": {"Description": " Product Data Scientist London From £50,000-£75,000 depending on experience An innovative FinTech who have received millions in funding over the last year are seeking to expand their Data Science function. This brand have a product that helps their customers better manage their money and they now have millions of customers globally.  You will work on advanced data science products, help the C-Suite understand customer insight and commercial analytics.  If you are technically savvy in SQL and Python, with the ability to analyse millions of rows of customer data to create commercial insights for a business and increase marketing effectiveness, then this could be the next step in your career. Product Data Scientist  Daily use of SQL and Python with a focus on building statistical models (machine learning, churn, regression, propensity, attribution)Analysing the performance of products and analysing marketing trends to inform business strategies Delivering insights and recommendations to diverse stakeholders both internally and externally on how to increase performance, conversion and product diversificationYou will work on digital projects as well including A/B testingYou will work on customer retention and acquisition strategiesYou will present visualisations on Tableau  You don't have to tick all of the boxes but some of the following would be relevant:  You will have commercial experience in SQL, Python and product analyticsYou will have experience within customer insight and marketing functionsIdeally you will have experience analysing customer, transactional and/or online data  Salary and Benefits The successful candidate can expect to earn up to £70,000! In addition, they have one of the best discretionary bonus systems in the industry, a healthcare package, flexible hours and numerous team benefits e.g. socials and sports clubs. ", "Salary": "£50,000 - £70,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40483092": {"Description": " Lead Data Scientist ** DIGITAL SOFTWARE PROVIDER ** LOCATION - North London SALARY - £60k - £70k plus strong benefits Did you love Hornby Model Railways when you were a kid - remember the advert?!Or perhaps you enjoy all things travel, transport and trains?Or maybe you have no interest in either but just LOVE getting your data science brain engaged in something truly unique and challenging?Then read on - as this role would suit a truly curious mind, with the ability to shape cutting edge solutions for the UK’s travel networks. You will be creating brand new, never been seen before data driven products and ways of working for controllers across  our nation. Working in a growing team of Data Scientists and Data Engineers, you will reporting into the Head of Data, using your skills in automation through machine learning, advanced statistical analysis and modelling to create a single source of truth, which in  turn can allow for predicting disruption, forecasting risk to rail operators and many other variables. Data is collected from signalling software (both real time and historical) and used to aid decisioning, with this company adding unique value through their  'world first’ embedded intelligence, whereby they integrating their products with tools used by the control rooms. Technically they operate a Python environment, so we are seeking people with advanced knowledge of this tool, ideally, but R will be considered. This niche industry offers huge amounts of potential for the use of creative, advanced machine learning and analytical approaches, with valuable insights being used to improve the UK’s rail network’s efficiency, safety and in turn commuter experiences. Your  intellectual curiosity and problem solving approach will be utilised in an ever evolving business, which has already set it’s self apart from global giants within the transport management software industry such as Hitachi and Talo, through innovation and agility. A unique opportunity to diversify your skills in a different industry with lots of growth opportunity and a chance to really test those brain cells! EXPERIENCE REQUIRED  Educated to at least degree level in a numerate subject such as Machine Learning, Computer Science, Mathematics, Statistics, Engineering, Physics, Chemistry etc.Experience in bringing insights to life, derived through advanced analytics and modelling, helping to improve decision making and building out data led solutions and productsStrong experience of Python or R for automation, machine learning, advanced statistical analysis and modellingIdeally experience and/or an interest in the transport industry, but not essentialHigh attention to detailGood communication skills, written, verbal, etc. TO APPLYFor further information or to apply please contact:Kate McDermott - Managing Consultant @ Blue Pelican Marketing Share through your CV to  Text me on Share through your LI profile if you’re non-active and simply curious You don’t have to have a CV to find a new job! We’re always keen to talk to good data experts.For more vacancies which may suit your needs, please visit us at www.bluepelican.com ", "Salary": "£75,000 - £85,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40584807": {"Description": " A rapidly expanding AI consultancy is currently looking for a Senior/Lead Data Scientist to join their pioneering team. From disruptive software to cutting-edge technology, the company is thinking big and looking to bring the right characters into the organisation  to facilitate their ideas in partnership with AWS. They actively encourage free thinkers who revel in environments without corporate restraints or small-minded mentalities. This role will see you delivering bespoke algorithms as an innovative solution to a range of their high profile global clients. You will be involved with the contribution of code, therefore, strong programming skills within data science in Python and the  libraries around this (Tensorflow, NumPy, Pandas, Sckit-Learn) would be essential. Alongside this, the successful candidate will need to have experience of some, if not all, standard data science techniques such as supervised/unsupervised machine learning,  classification such as Random Forest, time-series analysis and NLP. Candidates that have prior experience in a client-facing work environment would go to the top of the pile.  The company are well established and respected in the market and while leveraging the impressive skillset you have to offer, they will also provide high-level training from AWS to help you excel even more in your role. Alongside the training, a competitive  starting salary and benefits package is on offer and joining the company at this time of rapid expansion would give the opportunity to play an integral part in the bright future for the company. Please get in touch if you would like to hear more about this opportunity. Thank you for your interest - \"it's about people, not sales!\" ", "Salary": "£35,000 - £75,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40467268": {"Description": "My Client based in London is Currently searching for an Azure Data Scientist to join and become productive for a 6 month contract within their IM&T Team. The ideal candidate will be from a Data Science background with proficient experience with Machine  Learning. This role falls inside IR35.Must have -- Data Science background- Python Experience- SSAS experience- Azure background- R SkillsIf this role is of interest to you then please do apply or email me on Badenoch + Clark acts as an employment agency for permanent recruitment and an employment business for the supply of temporary workers. Badenoch + Clark UK is an Equal Opportunities Employer.By applying for this role your details will be submitted to Badenoch + Clark. Our Candidate Privacy Information Statement explains how we will use your information - please copy and paste the following link in to your browser: https://en-gb/candidate-privacy", "Salary": "£650.00 - £700.00 per day", "Location": "London", "Contract": "Permanent, full-time"}, "40572545": {"Description": " THE COMPANY  This organisation has always worked for a purpose - their purpose is to use the power of communications to make the world a better place. At their roots they are a technology company with research and innovation in their bones and a desire to be a personal,  simple. and brilliant for their customers. THE ROLE  In this role as a Lead Data Scientist you will be:  Use methodical Data Science techniques to select and tune algorithms and quantify business performanceTells engaging stories in a non-technical wayCreating Machine Learning algorithms Understanding, analysing and quantifying data analysis requirements, hand on testingExperimental design and outcomes analysis/reporting Analyse complex behavioural and sensory data statistical models SKILLS AND EXPERIENCE  Strong commercial Python experienceExperience with Machine Learning & developing modelsStrategic thinking & problem solving skills Passion for Data Science THE BENEFITS   Up to £100k SalaryCompetitive bonusCompetitive pension HOW TO APPLY Please register your interest by sending your CV to Daniel Moss via the Apply link on this page  ", "Salary": "Competitive salary", "Location": "Hertfordshire", "Contract": "Permanent, full-time"}, "40587228": {"Description": " PRODUCT DATA SCIENTIST - NLP POWERED APP LONDON - Flexible and home working available.  £70,000 Superb opportunity to join a high growth start up who're already shaking up the personal finance and fintech markets massively. Through the brands innovative AI features, they've worked with over 3 million customers globally and have achieved a licence to  operate in both the US and Canada which is forecasting to be a lucrative territory in the coming years. WHAT YOU'LL BE DOING This position is business critical as you will the enabling the business to make better data driven decisions across product, marketing and commercial operations. You will be working amongst a team of 6 data experts and play a vital role in the productionising  of models that feed directly into the product. These tasks include:  Build key Product Metrics and analyse user behaviour.Conduct regular a/b tests to optimise user journey on both app and desktop.Building user segmentation, marketing attribution and customer lifetime value models to optimise customer personalisation and targeting.Above all, you play a vital role in translating your analysis into actionable insights which will have a real business impact in a fast-growing market. WHAT YOU NEED  Excellent coding ability in SQL with experience working with millions of rows of dataAdvanced modelling skills in one or more of the following: SAS/R/PythonMarketing Attribution or Product analytics experienceA degree or higher in a numerical disciplineFantastic stakeholder skills BENEFITS  A salary of up to £70,000 based on experienceExtensive benefits packageCompany discountsFlexible working HOW TO APPLY Please register you interest by sending your CV to Jamie Smith via the apply link on this page. This client is conducting a virtual process and onboarding. ", "Salary": "£40,000 - £50,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40568565": {"Description": " Data Scientist£75,000 - £80,000London THE ROLE Harnham are currently working with an award-winning InsureTech start-up who are currently earning a lot of recognition for their work, and revolutionising their industry whilst they do it! As a business they focus their efforts on real-time machine learning for the good of the customer.  You will join as a key member of the team and work closely alongside both Data Scientists and Engineers to develop a market-leading pricing product. SKILLS AND EXPERTISE You will:  Build cutting-edge machine learning models which will be deployed and run in real-timeHave a huge variety of very rich data to work withWork with Python, PySpark, AWS, KubernetesHave a passion for deploying robust and scalable AI solutionsHave an interest in working closely with engineers, helping to drive the companies \"build\" mentality! HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Nick Mandella at Harnham. SALARY You can earn up to £80,000 + Options. KEYWORDS Python, Pyspark, spark, kubernetes, SQL, AWS, Machine Learning, Data Scientist, Data Science, ETL, Engineering, Scalable solutions, deployment.  ", "Salary": "Competitive salary", "Location": "London", "Contract": null}, "40578067": {"Description": " Principal Data ScientistRemote - Occasional work in London£75,000 - £85,000 We are representing a market-leading FTSE 100 business who are looking for a Principle Data Scientist to join their growing team. Sitting in a central data function, this role will involve working across numerous areas of the business, product and commercial  teams to understand needs and develop unique data solutions. You will have access to huge quantities of unique first party data to produce impactful data products. Not only will you be bringing internal value, but you will be involved in creating analytics solutions for external clients, to drive new revenue streams  for the business. We are looking for:  Strong academic background, minimum master's degree, ideally PhDExcellent experience in statistical analysis using Python (preferable) or RExposure to cloud technologies, ideally GCP It would be a bonus if you had:  Experience in Deep Learning, NLP or Neural NetworksPrevious work experience with geospatial dataConsultancy or customer-facing experience This role can be based remotely as long as you are able to travel to central London 1-2 days per week. If this sounds of interest, please apply for the position. £75,000 - £85,000Principal Data Scientist ", "Salary": "Competitive salary", "Location": "Hertfordshire", "Contract": null}}