{"40396679": {"Description": " DESCRIPTION Alexa Shopping Spoken Language Understanding team is looking for a senior data scientist to join a recently established team in London. The team’s mission is to ‘put the customer in the loop’ to improve the shopping experience on Alexa. The team will be  building systems to collect and use explicit and implicit signals from customer behavior. As the lead scientist on the team you will drive the investigation to make this data actionable. You will have considerable scope to direct the research to find the maximum  impact. This could include identifying leading indicators of customer dissatisfaction, using customer provided signals to improve existing Alexa language understanding models or operationalizing entirely new models to improve the experience for our customers.This is a blue-sky role that gives you a chance to roll up your sleeves and dive into big data sets in order to build simulations and experimentation systems at scale, build optimization algorithms and leverage cutting-edge technologies across Amazon. This  is an opportunity to think big about how to interpret the behavior of our customers and improve the voice shopping experience.You will work closely with product and technical leaders throughout Alexa Shopping and will be responsible for influencing technical decisions in areas of development/modelling that you identify as critical future product offerings. You will identify both enablers  and blockers of adoption for product understanding, and build programs to raise the bar in terms of understanding product questions and predict the shaping of customer utterances as we move from simple to complex utterances.The ideal candidate will have extensive experience in Science work, business analytics and have the aptitude to incorporate new approaches and methodologies while dealing with ambiguities in sourcing processes. Excellent business and communication skills are  a must to develop and define key business questions and to build data sets that answer those questions. You should have a demonstrated ability to think strategically and analytically about business, product, and technical challenges. Further, you must have  the ability to build and communicate compelling value propositions, and work across the organization to achieve consensus. This role requires a strong passion for customers, a high level of comfort navigating ambiguity, and a keen sense of ownership and drive  to deliver results.Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation ", "Salary": "£70,000 - £80,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40583658": {"Description": " DESCRIPTION Are you looking to work at the leading edge of advanced Machine Learning and Artificial Intelligence in healthcare and research?As a member of of the AWS EMEA Public Sector Healthcare Data Science team, you'll partner with our customers and AWS technology and business teams to help transform research, health and social care using AI and Cloud technologies.Example focus areas include Genomics, Clinical Decision Support, Population health and health system productivity.You will be working with terabytes of text, images, and other types of data to solve real-world problems. You'll develop novel use cases, design and run projects, research new algorithms, and find new ways of helping to improve clinical outcomes, productivity  and research using cloud.The primary responsibilities of this role are to:· Work with sales, business development and solution architecture teams to design and develop innovative solutions to healthcare customer needs· Use deep learning, machine learning and analytical techniques to create scalable solutions to address healthcare needs· Interact with customers directly to understand business challenges, develop use cases and solutions and help customers implement DL/ML algorithms and cloud technologies to solve problems· Analyze and extract relevant information from large amounts of historical data to help automate and optimize key processes· Work closely with account teams, research and product engineering teams to drive model implementations and new algorithmsThis position requires travel of up to 50%. ", "Salary": "Competitive salary", "Location": "Hertfordshire", "Contract": "Permanent, full-time"}, "40573533": {"Description": " DATA SCIENTIST -£450-£550 PER DAY1 MONTH INITIALLY REMOTE/ LONDON BASED As a Data Scientist creating a prototype for a new ML based product you will be using Python heavily alongside Plotly, specifically Dash to create powerful visualisations. THE COMPANY:  You will be working for a dynamic tech focused company. As a Data Scientist you will be working alongside more junior Data Scientists & Data Engineers in spearheading the use of Dash. You will be working in an agile and fast paced environment. THE ROLE:  As a Data Scientist, you will be coding in Python. It is imperative that you have extensive experience with Python and its basic ML packages. As a Data Scientist you will be focusing on applying ML systems for business critical requirements. This will be  using Plotly specifically Dash therefore you must have commercial experience with this and be able to demonstrate your expertise. As a Data Scientist you will be working in a GCP environment so experience within this platform and features such as Kubeflow  and Composer is valuable. They are looking for an individual who enjoy working in fast paced, dynamic and collaborative environment. YOUR SKILLS AND EXPERIENCE:  The successful Data Scientist will have the following skills and experience:  Extensive experience with Python and ML packages Commercial experience with Plotly, specifically DashWorked in a GCP environment  THE BENEFITS:   A chance to work in a highly dynamic environment  HOW TO APPLY:  Please register your interest by sending your CV to Anna Greenhill via the Apply link on this page. ", "Salary": "£55,000 - £60,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40568555": {"Description": " Data ScientistLondon (Zone 1)£65,000 - £75,000THE COMPANYHarnham are currently partnering with a global tech company who are currently hiring for a Data Scientist to join the business.  You will join a global team of Data Scientists, Engineers and Analysts spread across London, San Francisco, and Stockholm.  Your role will be to use advanced techniques to help improve product performance across the business and understand over 100mn customers globally.  THE ROLEYou will be expected to:  Work on a variety of projects related to customer behaviour, revenue optimisation, marketing effectiveness and campaign analysis. Collaborate closely with research, product and commercial teams to deliver machine learning at scale.Conduct A/B tests to help improve understanding of user behaviourIntroduce new and interesting ways to work with data to keep the business at the forefront of innovation within data science.Play a key role in helping the business deliver on their commercial goals through the use of data science. YOUR SKILLS AND EXPERIENCEYou must have:  An MSc or Ph.D. in a quantitative discipline (e.g. statistics, physics, mathematics)Experience in using machine learning and statistical models to improve product performanceEnd to end problem solving experienceStrong knowledge of Python and SQL THE BENEFITS~ £75,000 + BenefitsHOW TO APPLYPlease register your interest by sending your CV via the Apply link on this page. For more information about this role, or similar machine learning positions, please get in touch with Nick Mandella at Harnham. KEYWORDSPython, SQL, Machine learning, statistical modelling, A/B test, MVT, data scientist, data science, customer behaviour, marketing analytics.  ", "Salary": "£75,000 - £80,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40456690": {"Description": "Data Scientist - 3 months - West London Global FMCG is looking an experienced Data Scientist to support the commercial organisation in harnessing advanced analytics to drive business performance.The Data Scientist will be accountable for driving the development of advanced analytical models to solve challenging business problems. The individual will work with multi-disciplinary teams to understand the needs of the business and ensure that model outputs are translated into actionable business insights. This is a hands-on role and the successful candidate will be comfortable working in an agile environment and capable of leading delivery at pace.Key Responsibilities: - Contribute to a culture of agility and close partnership with the business to ensure timely delivery against critical priorities. - Partner with leaders in the analytics team and from across the business to understand key business challenges / questions which can be addressed using advanced analytics - Apply a broad array of modelling skills including driver analysis, machine learning and traditional statistics, to extract insights from structured and unstructured data sources. This information will also need to be integrated with complementary real-world  & digital information streams to address business challenges (e.g. Multi-Channel Analytics, Patient Pathways, Omni-Channel Segmentation, Territory Design, Next Best Action) - Actively participate and able to project manage in all stages of model development from data collection, data quality control, model building, model validation, testing and calibration. - Collaborate with teams in multiple locations for some complex analyses. - Continually learn new analytical skills, techniques and tools to maximise competitive advantage; participate in internal & external technology communities - Communicate technical subject matter clearly and concisely to audiences of various backgrounds - Provide input on the data architecture and be a contributor to the data governance framework - Provide guidance to offshore data scientists and data engineers * Partner with external agencies as needed- String Python skills are required Spring Technology acts as an employment agency for permanent recruitment and an employment business for the supply of temporary workers. The Spring Group UK is an Equal Opportunities Employer.By applying for this role your details will be submitted to Spring. Our Candidate Privacy Information Statement explains how we will use your information - please copy and paste the following link in to your browser: candidate-privacy-information-statement", "Salary": "£45,000 - £70,000 per annum", "Location": "London", "Contract": "Contract, full-time"}, "40349423": {"Description": " Data Scientist  Asset ManagementLondon£60,000 + Bonus THE COMPANY This is a unique chance to join a brand new team being set up in a leading asset management firm based in London. You will be a key member brought in to build a team who will focus on building data science products to support the wider business, everything from sales functions to internal investment processes. You will have the remit to build something which has never been done in the industry, as well as work with a great team of data scientists, engineers and analysts! THE ROLE You will be:  Utilising advanced analytics to build products and internal tools for the wider businessBuild an internal recommendation system to generate and keep business.Using data science techniques to understand customer behaviour and marketingLiaising with senior stakeholders Delivering effective analytics and visualisations for internal use YOUR SKILLS AND EXPERIENCE You must have:  An MSc in a statistical or engineering degreeExperience in programming languages such as R or PythonExperience in SQL is beneficialA proven track record of delivering business insights and supporting strategic decisions through the use of data scienceA can-do attitude and a passion for solving a range of complex problems with data! THE BENEFITS £60,000 + Benefits (including bonus) HOW TO APPLY Please register your interest by sending your CV via the Apply link on this page. KEYWORDS Python, R, SQL, Data Science, Data Scientist, Machine Learning.  ", "Salary": "£300 - £320 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40527404": {"Description": " ***Data Scientist - Ltd Contract - Remote/London***Data Scientist6 Month Rolling ContractRemote (Office is London)£Competitive Ltd CompanyMy client is a blue chip FMCG and retail brand that serve millions of customers every week from all over the globe. With over 6,000 stores internationally my client are a well known household name that offer a number of exciting opportunities. Our Data Science team focuses on modelling complex business problems and deploying data products at scale. Our work spans across multiple areas including physical stores, online, supply chain, marketing and Clubcard, where we encourage rotation amongst our  Data Scientists so they can gain expertise in different subjects. We work on several domains and problem types: online, pricing, security, fulfilment, distribution, property, IoT and computer vision are just some. Our team members spend 10% of their week on learning and personal development. Multiple academic collaborations  enrich the team expertise; knowledge sharing events are regular. Furthermore, we have got a great work-life balance, team days and relaxed but engaging culture. ROLE DESCRIPTIONThis is a hands-on position where you will need to leverage your analytical mindset to find solutions to complex problems. As a Data Scientist, you will need to understand difficult business problems and prototype solutions with minimal support. Apply, modify  and design algorithms and mathematical models to solve business problems on top of big data architectures (Hadoop, Spark) is a core component of the role. Our data scientists will need to be able to validate, document and present the modeling process and performances, as well as communicate complex solutions in a clear, understandable way to non-experts.CANDIDATE DESCRIPTION We are looking for ambitious individuals with a mix of statistics, programming and machine learning skills. The role requires that you have an extensive background in machine learning and data mining. A track record in modifying and designing advanced algorithms  and applying them to large data sets is essential. An ideal candidate will have a scientific mentality with the ability to ask the right questions, as well as answer them. A strong numerical higher degree in a mathematical, scientific, engineering or computer science discipline is preferable, as well as a solid  understanding of mathematics and statistical principles. Experience in one or more of the following fields is required:· Predictive modelling· Operational research· Deep learning and time series modelling· Finally, strong programming experience (Python is preferred) ", "Salary": "£45,000 - £75,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40532972": {"Description": " Data Scientist£75,000 - £80,000London THE ROLE Harnham are currently working with an award-winning InsureTech start-up who are currently earning a lot of recognition for their work, and revolutionising their industry whilst they do it! As a business they focus their efforts on real-time machine learning for the good of the customer.  You will join as a key member of the team and work closely alongside both Data Scientists and Engineers to develop a market-leading product. SKILLS AND EXPERTISE You will:  Build cutting-edge machine learning models which will be deployed and run in real-timeHave a huge variety of very rich data to work withWork with Python, PySpark, AWS, KubernetesHave a passion for deploying robust and scalable AI solutionsHave an interest in working closely with engineers, helping to drive the companies \"build\" mentality! HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Nick Mandella at Harnham. SALARY You can earn up to £80,000 + Options. KEYWORDS Python, Pyspark, spark, kubernetes, SQL, AWS, Machine Learning, Data Scientist, Data Science, ETL, Engineering, Scalable solutions, deployment.  ", "Salary": "£40,000 - £50,000 per annum, negotiable", "Location": "London", "Contract": "Permanent, full-time"}, "40460620": {"Description": " Data Scientist THE COMPANY Data Idols are working with a well know online brand to find an experienced Data Scientist. They are rapidly expanding their data teams across all areas due to their huge growth. THE ROLE Within this Data Scientist role, you will be developing and implementing custom algorithms to be used throughout the business and run optimisations to achieve commercial objectives and spot market opportunities. As an experienced Data Scientist you will:  Researching deep learning and NLP algorithms for the businessWorking closely with the data teamBuilding data-driven products for the business YOUR SKILLS AND EXPERIENCE  Experience working with large volumes of dataA strong understanding of Machine LearningKnowledge and commercial experience using Python, R and SQLMSc/Ph.D. in relevant field This is an outstanding opportunity to join an exciting company on a permanent basis with a great salary and benefits package. Please submit your CV for consideration. Data Scientist  ", "Salary": "£60,000 - £70,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40573407": {"Description": " Data Scientist  London FinTech Up to £70,000 + Benefits This is a fantastic opportunity to join an innovative fintech company within their advanced analytics team, giving you the ability to advance your data science skills. This is an excellent opportunity for an analyst with experience using SQL, R or Python,  to develop their skills in advanced analytics techniques. Duties and Responsibilities - Data Scientist  Design, plan and execute the targeting of customers through the company's targeted marketing programmeCreate and establish advanced customer analytics - e.g. segmentation, cohort analysis and customer retentionUsing statistical modelling methodologies to solve queries and optimise the marketing mixManage and conduct regular post campaign analysis, delivering actionable insights and recommendations using tools such as SQL, R and Python Skills and Qualifications - Data Scientist  University degree in a numerate discipline - ideally mathematics, statistics, engineering etcExperienced user of SQL and Python - specifically modellingPrior experience within B2C product analytics, ideally having carried out A/B testsStrong commercial awareness and ability to interact with various internal and external stakeholdersAbility to carry out a senior role within the team, as well as working independently to meet tight deadlinesWilling to learn new frameworks and languages as needed Salary and Benefits - Data Scientist Up to £70,000 + Benefits How To Apply - Data Scientist Please register your interest by submitting your CV via the apply link on this page. Key Words: SQL, R, Python, Data Scientist, Insight Analysis, Customer Insight, Customer Behaviour, Loyalty Analytics, Commercial Insight, Marketing Insight, Marketing Analytics, Segmentation, Clustering, Cluster Analysis, Regression, Propensity, Statistics, Statistical,  Statistical Modelling, Modelling, London ", "Salary": "Competitive salary", "Location": "Hertfordshire", "Contract": "Permanent, full-time"}, "40532757": {"Description": " Data Scientist Up to £75,000 + Benefits London The Company  Join a leading telecoms company who are looking to transform themselves into one of the best technology companies globally with data at the forefront of operations  The RoleAs a data scientist you will be responsible for developing end to end predictive models  Role and Responsibilities:   Develop machine learning and AI models that are scaled across multiple markets Providing commercially viable applications using deep/reinforced learning techniques Developing progressive analytic algorithms through exploiting rich data assets Skills and Requirements:  To qualify for this Data Scientist role, you will need:  Advanced analytics and programming for models through PythonExpertise in SQL/data manipulation skills required including cleaning and managing data.Commercial experience building a variety of machine learning models  HOW TO APPLY: Please register your interest by sending your CV to Sean via the Apply link on this page. ", "Salary": "£40,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40502659": {"Description": "Data Scientist - 11 month contract - £320 per dayOverview An excellent opportunity has arisen with a Global Leader in Social Media for a talented and enthusiastic Data Scientist.The role ·Construct predictive models, algorithms and probability engines to support data analysis or product functions ·Design experiments and methodologies to generate and collect data for business use.·Use advanced mathematical and statistical concepts and theories to analyse and collect data and construct solutions to business problems. ·Perform complex statistical analysis on experimental or business data to validate and quantify trends or patterns identified by business analysts.Requirements:·2 years of relevant work experience ·Experience applying advanced analytics to business problems Proficiency in SQL ·Experience with Python or R, as well as big data systems such as Hive Understanding of key user life cycle concepts (acquisition, engagement, retention, monetisation) ·Experience with funnel analysis and A/B tests.·Excellent problem-framing, problem-solving and project management skills.·Experience framing and articulating important product questions, selecting the right statistical tools and visualisations to obtain answers from data, translating them into business recommendations ·Experience working with cross functional teams: product managers, engineers, researchers, marketers.Education:·BSC degree in a quantitative discipline ·Excellent communication skills: written, verbal, PowerPoint presentations.Data Scientist - 11 month contract - £320 per day", "Salary": "£85,000 - £95,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40483213": {"Description": " Data Scientist ** DIGITAL SOFTWARE PROVIDER ** LOCATION - North London SALARY - £40k - £60k plus strong benefits Did you love Hornby Model Railways when you were a kid - remember the advert?!Or perhaps you enjoy all things travel, transport and trains?Or maybe you have no interest in either but just LOVE getting your data science brain engaged in something truly unique and challenging?Then read on - as this role would suit a truly curious mind, with the ability to shape cutting edge solutions for the UK’s travel networks. You will be creating brand new, never been seen before data driven products and ways of working for controllers across  our nation. Working in a growing team of Data Scientists and Data Engineers, you will reporting into the Head of Data, using your skills in automation through machine learning, advanced statistical analysis and modelling to create a single source of truth, which in  turn can allow for predicting disruption, forecasting risk to rail operators and many other variables. Data is collected from signalling software (both real time and historical) and used to aid decisioning, with this company adding unique value through their  'world first’ embedded intelligence, whereby they integrating their products with tools used by the control rooms. Technically they operate a Python environment, so we are seeking people with advanced knowledge of this tool, ideally, but R will be considered. This niche industry offers huge amounts of potential for the use of creative, advanced machine learning and analytical approaches, with valuable insights being used to improve the UK’s rail network’s efficiency, safety and in turn commuter experiences. Your  intellectual curiosity and problem solving approach will be utilised in an ever evolving business, which has already set it’s self apart from global giants within the transport management software industry such as Hitachi and Talo, through innovation and agility. A unique opportunity to diversify your skills in a different industry with lots of growth opportunity and a chance to really test those brain cells! EXPERIENCE REQUIRED  Educated to at least degree level in a numerate subject such as Machine Learning, Computer Science, Mathematics, Statistics, Engineering, Physics, Chemistry etc.Experience in bringing insights to life, derived through advanced analytics and modelling, helping to improve decision making and building out data led solutions and productsStrong experience of Python or R for automation, machine learning, advanced statistical analysis and modellingIdeally experience and/or an interest in the transport industry, but not essentialHigh attention to detailGood communication skills, written, verbal, etc. TO APPLYFor further information or to apply please contact:Kate McDermott - Managing Consultant @ Blue Pelican Marketing Share through your CV to  Text me on Share through your LI profile if you’re non-active and simply curious You don’t have to have a CV to find a new job! We’re always keen to talk to good data experts.For more vacancies which may suit your needs, please visit us at www.bluepelican.com ", "Salary": "£60,000 - £70,000 per annum", "Location": "London", "Contract": null}, "40568434": {"Description": " Data Scientist / Senior Data Scientist - Temporarily Remote WorkingLondon £45,000 - £75,000 This is an exciting new opportunity for a Data Scientist to work for a really successful and technology company.  THE COMPANY This is an established business who have invested heavily in their Data function and they are now looking for a Data Scientist to join one of their specialist functions with a focus on the product and it's user behaviour. You'll be joining a team of 3 working  in a specialist area but sitting within a much larger Data Science function so you'll be surrounded by experts in this field. They need someone who has experience using both Python & SQL, AB testing and machine learning experience working in a product focused  environment - if this is you, this could be a great next step and get experience working for a well-known brand. THE ROLE As a Data Scientist for the business you will:  Use data to understand how the customers are using the product and studying what people are engaging withUse machine learning techniques, particularly regression modelling, predictive modelling, clustering and classification in order to predict customers engagementYou will use AB testing techniques to optimise these modelsLiaise with stakeholders across the business to understand their business needs SKILLS AND EXPERIENCE  PHD/Masters/Bachelors in a numerical or relevant field is preferredProven experience working in a product focused environment looking at the customer lifetime valueAn excellent understanding of and experience with machine learning techniquesAB testing experience is essentialTech: Python, SQL SALARY AND BENEFITS  Basic salary £45,000 - £75,000 depending on levelBonus schemeBenefits package HOW TO APPLY Please register your interest for this role by sending your CV to Rosie O'Callaghan via the apply link on this page Please note that our client is currently running a fully remote interview process, and is able to on-board and hire remotely as well. This role is intended to be home working for the duration of the pandemic. ", "Salary": null, "Location": null, "Contract": null}, "40573327": {"Description": " DATA SCIENTIST  LONDON £50,000- £70,000 +BENEFITS THE COMPANY An exciting role working for a technology-driven online business who are in a growth stage. You will report directly into the Data Director and be part of creating the data direction. The aim of this position is to build the data pipeline and start implementing  advanced analytics. THE ROLE As a Data Scientist, you will in a growing analytics function. Some of your main responsibilities will be:  Analyse customer data to provide insights on customer personalisation.Build statistical models, focusing on customer segmentation projects.Build and manage key stakeholder relationships and expectations.Share analytical results in a commercial manner, with the ability to visualise insights with impact.Work to build the data pipeline. YOUR SKILLS AND EXPERIENCE A successful Data Scientist will have:  Degree level or higher in a STEM subject.Excellent interpersonal and communication skills, able to proactively network across functions and influence at all levels.Expert in a range of statistical and programming software; SQL and visualisationExperience having built advanced models in Python or R is essential.Experience building out a data pipeline would be ideal. THE BENEFITS  A salary of up to £70,000.Comprehensive benefits package.Lots of ownership of projects. HOW TO APPLY Please register your interest by sending your CV to Lydia via the apply link on this page. ", "Salary": null, "Location": null, "Contract": null}, "40513081": {"Description": " Data Scientist Location: London Salary: Circa 40K - 50K + Benefits Data Scientist required by fast-growing, pioneering AI Company! This is an integral, varied role responsible for building Machine Learning Models for their platform Essential experience:  Python development experienceDeep experience using Pytorch & Tensor flowDeveloping & productionising machine learning modelsAWS SagemakerDeep experience in Natural Language ProcessingWorking on production ChatbotsKnowledge of Transformer Models such as Bert, Roberta, ElmoKnowledge of NLP Open Source Libraries e.g. Hugging Face, AI2, OpenAI, Spacy Tremendous opportunity in a dynamic, friendly team where you’ll be able to keep up-to-date with the latest technologies and enjoy a healthy work/life balance! Apply now for FULL details! ", "Salary": null, "Location": null, "Contract": null}, "40555263": {"Description": " Data Scientist London £50,000 - £55,000 + Benefits Our client, an exciting RegTech business is looking to recruit for a Data Scientist to join their growing team. The successful candidate will be joining the artificial intelligence team, working on a brand new product to the business. You will be working  with large amounts of structured data, whilst being able to experiment with your approach. Responsibilities  Building consolidated data pipelines and prototype analysesTesting new approaches to optimise successBe involved in team troubleshooting and code reviewsMonitoring models in productionWork closely with key stakeholdersLook for business problems that can be solved using data scienceKeeping up to date with technological innovations Experience  Machine learning skills, alongside a good theoretical understandingAbility to explain complex ideas to non-technical colleagues and clientsExtensive mathematics, ie probability, statistics and linear algebraData visualisationDevelopment skills - testing, version control, data structures and algorithmsProgramming with PythonExperience using data science packages such as Pandas and scikit-learnFrameworks experience with Keras, Tensorflow and PyTorchCloud computing experience (AWS)Knowledge of machine learning techniques such as anomaly detection, record linkage, NLP and unsupervised methods If this position sounds exciting to you, please apply now! For further information, please contact Kat Hall at Real Time Consultants. Real Time Consultants are acting as an employment business/agency in relation to this vacancy. ", "Salary": null, "Location": null, "Contract": null}, "40477650": {"Description": " Data Scientist - Central London This is a fantastic new role offering you the opportunity to work at one the market's leading sportsbook businesses and make a real impact on the direction of their growth. Data science is at the core of the company's digital transformation and this opportunity  will allow the successful applicant to shape the content and customer experience of their offering moving forward. Based in Central London, this is a role not to be missed by anyone passionate about data science! The Role:  Research and develop data models and algorithmsDevelop processes and tools to monitor/analyse model performanceCollaborate cross-functionally to devise solutions to company needsEffectively communicate results and ideas to key stakeholdersKeep up with latest tech trendsImplement new statistical/mathematical methodologies where required for specific modelsWork within agreed agile methodology About you:  A Masters or PHD in a quantitative disciplineStrong experience with manipulating data sets and building statistical models to drive resultsExcellent experience using Python and SQLKnowledge of advanced statistical techniques and conceptsOutstanding communication skills - able to articulate concepts and idea effectively Apply Now You can apply for this role now by sending us your CV or by calling us now! Don't forget to register as a candidate too. Tom Gould Senior Consultant //  Sphere Digital Recruitment currently have a variety of job opportunities across digital so feel free to get in touch with us to find out how we can help you. You can see more of my current vacancies by looking at my profile here https://consultants/tom-gould Sphere Digital Recruitment are specialists in placing marketing, sales, analytics, product and creative ?talent globally. ", "Salary": null, "Location": null, "Contract": null}, "40567113": {"Description": " A Financial Data and information provider based in Central London are looking to added Data Scientists to their growing Data Science function. They are looking to add 3 new members within this skillset.  The Role:  The right candidate will have strong experience in Deep Learning and Image Processing and will likely have 3+ years' industry experience working within the above areas. The candidate is also likely to have a strong academic background from a top University.  Required skills and experience: • MSc/PhD in Numerical or Analytical subject from Top University • Experience in Machine Learning • Deep Learning * Image Processing  (The client are also happy to consider candidates with relevant PhD subjects)  Salary: £70,000-£140,000 + competitive package (depending on experience  Initial stage interviews are commencing on from Monday next week and the client are keen to get the right candidates on board as soon as possible.  If this role is of interest or you require more information, please get in touch with an updated CV to . ", "Salary": null, "Location": null, "Contract": null}, "40590285": {"Description": "Site Name: UK - Hertfordshire - StevenagePosted Date: Jul 10 2020Data Scientist GlaxoSmithKline is a world leading research-based pharmaceutical company that combines both individual talent and technical resources to create a platform for the delivery of strong growth in a rapidly changing healthcare market. Our mission is to improve  the quality of human life by enabling people to do more, feel better and live longer. We have vacancy within our Biopharm Process Research team. BioPharm Process Research (BPR) is an early process development function responsible for de-risking and accelerating biopharmaceutical assets into clinical manufacture and onward late-stage development. Due to recent investments in scale-down, high-throughput  process and analytical technology within BPR an exciting new informatics opportunity exists to fully exploit the data generated to deliver deeper and faster understanding of cell line and molecule quality in our process design space. The successful candidate would support data driven advances in cell line generation, characterisation and selection and the onward process de-risking occurring in BPR. There is an expectation that the candidate will stay connected with the wider modelling  community within GSK at its global sites and contribute to development of good practices. Key Responsibilities include, but are not limited to:  To work as part of a multi-disciplinary department to identify the most impactful workflows that will derive unique cell, process and molecule understanding.Development, implementation and application of workflows for data processing and statistical analysis.Development and application of bioinformatics tools for the visualisation of omics data, biological network modelling and network mapping.Apply advanced data analysis and model building to identify relationships between key cellular and process characteristics and product quality and determine methods to exploit and apply this knowledge in the BPR project workflow. Seek all opportunities to develop and maintain a strong IP position. Deliver prioritised, aligned, milestone driven plans of all work to be undertaken. Represent BPR as an expert in internal and external meetings and projects contributing to informatics strategy as required.Train and share knowledge and ways of working internally to up-skill existing staff to help drive forward the BPR, and wider GSK, informatics ambitions.  Closing Date for Applications: Friday 24th July 2020 (COB) Please take a copy of the Job Description, as this will not be available post closure of the advert. When applying for this role, please use the ‘cover letter’ of the online application or your CV to describe how you meet the competencies for this role, as outlined in the job requirements above. The information that you have provided in your cover letter and  CV will be used to assess your application.During the course of your application you will be requested to complete voluntary information which will be used in monitoring the effectiveness of our equality and diversity policies. Your information will be treated as confidential and will not be used  in any part of the selection process. If you require a reasonable adjustment to the application / selection process to enable you to demonstrate your ability to perform the job requirements please contact. This will help us to understand any modifications  we may need to make to support you throughout our selection process. *LI-GSK Why you? Required Qualifications and Experience: We are looking for professionals with these required skills to achieve our goals:  An advanced degree (MSc, PhD) in Computer Science, Bioinformatics or a related Life Science discipline with a strong background in mathematics, statistical analysis, programming, data mining, data visualisation and applied data science.An ability to work as part of a cross-functional team, engaging other scientists with complementary skill-sets.Strong communication skills with demonstrated track-record of effectively delivering data-driven solutions and tools to scientists and stakeholders.A ‘disruptive’ mindset, proposing novel approaches to challenging scientific questions.  Why GSK?  Our values and expectations are at the heart of everything we do and form an important part of our culture. These includePatient focus, Transparency, Respect, Integrity along with Courage, Accountability, Development, and Teamwork. As GSK focuses on our values and expectations and a culture of innovation, performance, and trust, the successful candidate  will demonstrate the following capabilities:   Operating at pace and agile decision-making – using evidence and applying judgement to balance pace, rigour and risk.Committed to delivering high quality results, overcoming challenges, focusing on what matters, execution.Continuously looking for opportunities to learn, build skills and share learning.Sustaining energy and well-being.Building strong relationships and collaboration, honest and open conversations.Budgeting and cost-consciousness. As a company driven by our values of Patient focus, Transparency, Respect and Integrity, we know inclusion and diversity are essential for us to be able to succeed. We want all our colleagues to thrive at GSK bringing their unique experiences, ensuring they  feel good and to keep growing their careers. As a candidate for a role, we want you to feel the same way. As an Equal Opportunity Employer, we are open to all talent. In the US, we also adhere to Affirmative Action principles. This ensures that all qualified applicants will receive equal consideration for employment without regard to race/ethnicity, colour,  national origin, religion, gender, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class*(*US  only). We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are. Please don’t hesitate to contact us if you’d like to discuss any adjustments to our process which might help you demonstrate your strengths and capabilities. You can either call us on, or send an email <span", "Salary": null, "Location": null, "Contract": null}, "40460757": {"Description": " Lead Data ScientistLondon (Zone 1)£85,000 - £95,000THE COMPANYHarnham are currently partnering with a global tech company who are currently hiring for a Lead Data Scientist to join the business.  You will join a global team of Data Scientists, Engineers and Analysts spread across London, San Francisco, and Stockholm. THE ROLEYou will be expected to:  Manage and mentor a growing team of Data ScientistsLead a variety of projects related to customer behaviour, marketing effectiveness and campaigns. Collaborate closely with research, product and commercial teams to deliver real-time machine learning at scale.Introduce new and interesting ways to work with data to keep the business at the forefront of innovation within data science. YOUR SKILLS AND EXPERIENCEYou must have:  An MSc or Ph.D. in a quantitative discipline (e.g. statistics, physics, mathematics)Several years of demonstrated machine learning experience to solve a wide array of commercial problemsEnd to end problem solving experienceStrong knowledge of Python or R, and SQL THE BENEFITS~ £95,000 + BenefitsHOW TO APPLYPlease register your interest by sending your CV via the Apply link on this page. For more information about this role, or similar machine learning positions, please get in touch with Nick Mandella at Harnham. KEYWORDSPython, Machine learning, data scientist, data science, customer behaviour, marketing analytics.  ", "Salary": null, "Location": null, "Contract": null}, "40511722": {"Description": " Data Scientist (Remote)London£40,000+ THE COMPANY Harnham are working with a very exciting online marketplace in the UK right now who are currently looking for a Data Scientist to join their data science function. You will join a team of 10 data scientists responsible for work in recommender systems, customer behaviour and product optimisation. You will be required to work on production-level machine learning problems, and be able to also excel in areas of data engineering and software engineering too. Part of your role will also be to drive the use of cutting-edge methodologies for the business. Tech stack: Python & Spark. YOUR SKILLS AND EXPERIENCE You must have:  An MSc or Ph.D. in Machine Learning, Statistics, Computer Science, Artificial Intelligence or MathematicsA broad range of data science skills and variety of technical proficienciesProficiency in a variety of machine learning techniques THE BENEFITS £40,000 +  HOW TO APPLY Please register your interest by sending your CV via the Apply link on this page. CONTACT Please contact Nick Mandella at Harnham for more information. KEYWORDS Python, SQL, Spark, Machine Learning, Recommender, Recommendation System, Research, Customer, Insight, Marketing, Product, Online, Data Scientist, Data Science, Predictive modelling, Forecasting. ", "Salary": null, "Location": null, "Contract": null}, "40568591": {"Description": " Lead Data ScientistLondon (Zone 1)£85,000 - £95,000THE COMPANYHarnham are currently partnering with a global tech company who are currently hiring for a Lead Data Scientist to join the business.  You will join a global team of Data Scientists, Engineers and Analysts spread across London, San Francisco, and Stockholm. THE ROLEYou will be expected to:  Manage and mentor a growing team of Data ScientistsLead a variety of projects related to customer behaviour, marketing effectiveness and campaigns. Collaborate closely with research, product and commercial teams to deliver real-time machine learning at scale.Introduce new and interesting ways to work with data to keep the business at the forefront of innovation within data science. YOUR SKILLS AND EXPERIENCEYou must have:  An MSc or Ph.D. in a quantitative discipline (e.g. statistics, physics, mathematics)Several years of demonstrated machine learning experience to solve a wide array of commercial problemsEnd to end problem solving experienceStrong knowledge of Python or R, and SQL THE BENEFITS~ £95,000 + BenefitsHOW TO APPLYPlease register your interest by sending your CV via the Apply link on this page. For more information about this role, or similar machine learning positions, please get in touch with Nick Mandella at Harnham. KEYWORDSPython, Machine learning, data scientist, data science, customer behaviour, marketing analytics.  ", "Salary": null, "Location": null, "Contract": null}, "40510043": {"Description": " Data Science LeadLondon (Zone 1)£85,000 - £95,000THE COMPANY -Data Science Lead Harnham are currently partnering with a global tech company who are currently hiring for a Data Science Lead to join the business.  You will join a global team of Data Scientists, Engineers and Analysts spread across London, San Francisco, and Stockholm. THE ROLE -Data Science Lead You will be expected to:  Manage and mentor a growing team of Data ScientistsLead a variety of projects related to customer behaviour, marketing effectiveness and campaigns. Collaborate closely with research, product and commercial teams to deliver real-time machine learning at scale.Introduce new and interesting ways to work with data to keep the business at the forefront of innovation within data science. YOUR SKILLS AND EXPERIENCEYou must have:  An MSc or Ph.D. in a quantitative discipline (e.g. statistics, physics, mathematics)Several years of demonstrated machine learning experience to solve a wide array of commercial problemsEnd to end problem solving experienceStrong knowledge of Python or R, and SQL THE BENEFITS~ £95,000 + BenefitsHOW TO APPLYPlease register your interest by sending your CV via the Apply link on this page. For more information about this role, or similar machine learning positions, please get in touch with Nick Mandella at Harnham. KEYWORDSPython, Machine learning, data scientist, data science, customer behaviour, marketing analytics.  ", "Salary": null, "Location": null, "Contract": null}, "40601106": {"Description": " Do you want to work for one of the fastest growing start-ups in London?! I am looking for a highly-motivated, resilient problem-solver. Someone who seeks out challenges and is ready to implement compelling solutions to complex problems. By analysing, predicting and inferring from unstructured( or structured) financial data, you would help create software API products which would facilitate customers making better business decisions . This would be a position where you would get a chance  to start from scratch and help build the product Required skills:  Masters/PhD or equivalent experience in a quantitative field such as Statistics, Computer Science, Applied Sciences or Operational Research6+ years experience applying Machine Learning to real-world problemsUse data insights to design and build Machine Learning algorithmsHands-on experience with datasets (i.e. data extraction, cleaning, analysis and presentation).Demonstrated ability to provide insights from data sets.Understanding of statistics and optimisation techniques.Comfortable coding in R, Python, JavaLeverage tools like Hadoop & SQL to drive efficient analytics.NoSql databases, e.g. Cassandra, BigTableSQL and relational databases, preferably PostgreSQLXML and related technologies ( XML Schema, XPath )Experienced with cloud infrastructure (GCP, AWS, Azure) Personal Profile The successful candidate will:  Be motivated to take complete ownership of the product.Be willing to learn new technologies and implement them.Possess Excellent verbal and written communication skills. Ability to communicate complex ideas in a simple fashionPay attention to detail and have a commitment to quality. ", "Salary": null, "Location": null, "Contract": null}, "40483092": {"Description": " Lead Data Scientist ** DIGITAL SOFTWARE PROVIDER ** LOCATION - North London SALARY - £60k - £70k plus strong benefits Did you love Hornby Model Railways when you were a kid - remember the advert?!Or perhaps you enjoy all things travel, transport and trains?Or maybe you have no interest in either but just LOVE getting your data science brain engaged in something truly unique and challenging?Then read on - as this role would suit a truly curious mind, with the ability to shape cutting edge solutions for the UK’s travel networks. You will be creating brand new, never been seen before data driven products and ways of working for controllers across  our nation. Working in a growing team of Data Scientists and Data Engineers, you will reporting into the Head of Data, using your skills in automation through machine learning, advanced statistical analysis and modelling to create a single source of truth, which in  turn can allow for predicting disruption, forecasting risk to rail operators and many other variables. Data is collected from signalling software (both real time and historical) and used to aid decisioning, with this company adding unique value through their  'world first’ embedded intelligence, whereby they integrating their products with tools used by the control rooms. Technically they operate a Python environment, so we are seeking people with advanced knowledge of this tool, ideally, but R will be considered. This niche industry offers huge amounts of potential for the use of creative, advanced machine learning and analytical approaches, with valuable insights being used to improve the UK’s rail network’s efficiency, safety and in turn commuter experiences. Your  intellectual curiosity and problem solving approach will be utilised in an ever evolving business, which has already set it’s self apart from global giants within the transport management software industry such as Hitachi and Talo, through innovation and agility. A unique opportunity to diversify your skills in a different industry with lots of growth opportunity and a chance to really test those brain cells! EXPERIENCE REQUIRED  Educated to at least degree level in a numerate subject such as Machine Learning, Computer Science, Mathematics, Statistics, Engineering, Physics, Chemistry etc.Experience in bringing insights to life, derived through advanced analytics and modelling, helping to improve decision making and building out data led solutions and productsStrong experience of Python or R for automation, machine learning, advanced statistical analysis and modellingIdeally experience and/or an interest in the transport industry, but not essentialHigh attention to detailGood communication skills, written, verbal, etc. TO APPLYFor further information or to apply please contact:Kate McDermott - Managing Consultant @ Blue Pelican Marketing Share through your CV to  Text me on Share through your LI profile if you’re non-active and simply curious You don’t have to have a CV to find a new job! We’re always keen to talk to good data experts.For more vacancies which may suit your needs, please visit us at www.bluepelican.com ", "Salary": null, "Location": null, "Contract": null}, "40502398": {"Description": " Lead Data Scientist - FinTech We have an amazing opportunity to join a startup FinTech business, and be the first founding Data Scientist within the business which will allow a huge scope to scale this area out within the business. This is a very financially well backed with large plans,  looking to add to the disruption within the financial services space. The Co-Founders ex-silicon valley and have a strong track records or building successful tech teams. You will be spearheading the design and implementation of solutions created via the Data Science platform. Developing innovative algorithms and data models to gain real insight into consumer financial data to make a real difference to customers. They are looking for someone with a background in: ·Designing and building machine learning algorithms ·Coding in Python, Java or R ·Working with large data sets - data extraction, cleansing, analysis and presentation ·Familiarity with relational SQL databases and NoSQL databases ·XML and related technologies ·Cloud Infrastructure (AWS, Azure or GCP) ·MsC or PhD education in relatable field - Statistics, Computer Science, Data Science, Mathematics It would be very useful if you had the following experience but not essential: ·Leveraging big data technologies on Hadoop platforms ·Working for a FinTech / Challenger Bank There is a very strong package on offer, including equity within the business. If being involved at an early stage and really having ownership and freedom to deliver Data Science solutions sounds interesting, then please do apply! This job ad was posted by Salt. To find out more about Salt's Privacy Policy and how your application is processed, please visit our website https://privacy-policy/. ", "Salary": null, "Location": null, "Contract": null}, "40509594": {"Description": " THE COMPANY  This organisation has always worked for a purpose - their purpose is to use the power of communications to make the world a better place. At their roots they are a technology company with research and innovation in their bones and a desire to be a personal,  simple. and brilliant for their customers. THE ROLE  In this role as a Senior Data Scientist you will be:  Use methodical Data Science techniques to select and tune algorithms and quantify business performanceTells engaging stories in a non-technical wayCreating Machine Learning algorithms Understanding, analysing and quantifying data analysis requirements, hand on testingExperimental design and outcomes analysis/reporting Analyse complex behavioural and sensory data statistical models SKILLS AND EXPERIENCE  Strong commercial Python experienceExperience with Machine Learning & developing modelsStrategic thinking & problem solving skills Passion for Data Science THE BENEFITS   Up to £100k SalaryCompetitive bonusCompetitive pension HOW TO APPLY Please register your interest by sending your CV to Daniel Moss via the Apply link on this page  ", "Salary": "£35,000 - £75,000 per annum", "Location": "London", "Contract": "Contract, full-time"}, "40572991": {"Description": " Product Data Scientist London From £50,000-£75,000 depending on experience An innovative FinTech who have received millions in funding over the last year are seeking to expand their Data Science function. This brand have a product that helps their customers better manage their money and they now have millions of customers globally.  You will work on advanced data science products, help the C-Suite understand customer insight and commercial analytics.  If you are technically savvy in SQL and Python, with the ability to analyse millions of rows of customer data to create commercial insights for a business and increase marketing effectiveness, then this could be the next step in your career. Product Data Scientist  Daily use of SQL and Python with a focus on building statistical models (machine learning, churn, regression, propensity, attribution)Analysing the performance of products and analysing marketing trends to inform business strategies Delivering insights and recommendations to diverse stakeholders both internally and externally on how to increase performance, conversion and product diversificationYou will work on digital projects as well including A/B testingYou will work on customer retention and acquisition strategiesYou will present visualisations on Tableau  You don't have to tick all of the boxes but some of the following would be relevant:  You will have commercial experience in SQL, Python and product analyticsYou will have experience within customer insight and marketing functionsIdeally you will have experience analysing customer, transactional and/or online data  Salary and Benefits The successful candidate can expect to earn up to £70,000! In addition, they have one of the best discretionary bonus systems in the industry, a healthcare package, flexible hours and numerous team benefits e.g. socials and sports clubs. ", "Salary": "Salary negotiable", "Location": "London", "Contract": "Permanent, full-time"}, "40598389": {"Description": " Product Data Scientist London From £50,000-£75,000 depending on experience An innovative FinTech who have received millions in funding over the last year are seeking to expand their Data Science function. This brand have a product that helps their customers better manage their money and they now have millions of customers globally.  You will work on advanced data science products, help the C-Suite understand customer insight and commercial analytics.  If you are technically savvy in SQL and Python, with the ability to analyse millions of rows of customer data to create commercial insights for a business and increase marketing effectiveness, then this could be the next step in your career. Product Data Scientist  Daily use of SQL and Python with a focus on building statistical models (machine learning, churn, regression, propensity, attribution)Analysing the performance of products and analysing marketing trends to inform business strategies Delivering insights and recommendations to diverse stakeholders both internally and externally on how to increase performance, conversion and product diversificationYou will work on digital projects as well including A/B testingYou will work on customer retention and acquisition strategiesYou will present visualisations on Tableau  You don't have to tick all of the boxes but some of the following would be relevant:  You will have commercial experience in SQL, Python and product analyticsYou will have experience within customer insight and marketing functionsIdeally you will have experience analysing customer, transactional and/or online data  Salary and Benefits The successful candidate can expect to earn up to £70,000! In addition, they have one of the best discretionary bonus systems in the industry, a healthcare package, flexible hours and numerous team benefits e.g. socials and sports clubs. ", "Salary": "£65,000 - £95,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40586704": {"Description": " Product Data Scientist London From £50,000-£70,000 depending on experience An innovative FinTech who have received millions in funding over the last year are seeking to expand their Data Science function. This brand have a product that helps their customers better manage their money and they now have millions of customers globally.  You will work on advanced data science products, help the C-Suite understand customer insight and commercial analytics.  If you are technically savvy in SQL and Python, with the ability to analyse millions of rows of customer data to create commercial insights for a business and increase marketing effectiveness, then this could be the next step in your career. Product Data Scientist  Daily use of SQL and Python with a focus on building statistical models (machine learning, churn, regression, propensity, attribution)Analysing the performance of products and analysing marketing trends to inform business strategies Delivering insights and recommendations to diverse stakeholders both internally and externally on how to increase performance, conversion and product diversificationYou will work on digital projects as well including A/B testingYou will work on customer retention and acquisition strategiesYou will present visualisations on Tableau  You don't have to tick all of the boxes but some of the following would be relevant:  You will have commercial experience in SQL, Python and product analyticsYou will have experience within customer insight and marketing functionsIdeally you will have experience analysing customer, transactional and/or online data  Salary and Benefits The successful candidate can expect to earn up to £70,000! In addition, they have one of the best discretionary bonus systems in the industry, a healthcare package, flexible hours and numerous team benefits e.g. socials and sports clubs. ", "Salary": "£60,000 - £70,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40467268": {"Description": "My Client based in London is Currently searching for an Azure Data Scientist to join and become productive for a 6 month contract within their IM&T Team. The ideal candidate will be from a Data Science background with proficient experience with Machine  Learning. This role falls inside IR35.Must have -- Data Science background- Python Experience- SSAS experience- Azure background- R SkillsIf this role is of interest to you then please do apply or email me on Badenoch + Clark acts as an employment agency for permanent recruitment and an employment business for the supply of temporary workers. Badenoch + Clark UK is an Equal Opportunities Employer.By applying for this role your details will be submitted to Badenoch + Clark. Our Candidate Privacy Information Statement explains how we will use your information - please copy and paste the following link in to your browser: https://en-gb/candidate-privacy", "Salary": "£40,000 - £50,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40572545": {"Description": " THE COMPANY  This organisation has always worked for a purpose - their purpose is to use the power of communications to make the world a better place. At their roots they are a technology company with research and innovation in their bones and a desire to be a personal,  simple. and brilliant for their customers. THE ROLE  In this role as a Lead Data Scientist you will be:  Use methodical Data Science techniques to select and tune algorithms and quantify business performanceTells engaging stories in a non-technical wayCreating Machine Learning algorithms Understanding, analysing and quantifying data analysis requirements, hand on testingExperimental design and outcomes analysis/reporting Analyse complex behavioural and sensory data statistical models SKILLS AND EXPERIENCE  Strong commercial Python experienceExperience with Machine Learning & developing modelsStrategic thinking & problem solving skills Passion for Data Science THE BENEFITS   Up to £100k SalaryCompetitive bonusCompetitive pension HOW TO APPLY Please register your interest by sending your CV to Daniel Moss via the Apply link on this page  ", "Salary": "£90,000 - £120,000 per annum", "Location": "London", "Contract": "Contract, full-time"}, "40584807": {"Description": " A rapidly expanding AI consultancy is currently looking for a Senior/Lead Data Scientist to join their pioneering team. From disruptive software to cutting-edge technology, the company is thinking big and looking to bring the right characters into the organisation  to facilitate their ideas in partnership with AWS. They actively encourage free thinkers who revel in environments without corporate restraints or small-minded mentalities. This role will see you delivering bespoke algorithms as an innovative solution to a range of their high profile global clients. You will be involved with the contribution of code, therefore, strong programming skills within data science in Python and the  libraries around this (Tensorflow, NumPy, Pandas, Sckit-Learn) would be essential. Alongside this, the successful candidate will need to have experience of some, if not all, standard data science techniques such as supervised/unsupervised machine learning,  classification such as Random Forest, time-series analysis and NLP. Candidates that have prior experience in a client-facing work environment would go to the top of the pile.  The company are well established and respected in the market and while leveraging the impressive skillset you have to offer, they will also provide high-level training from AWS to help you excel even more in your role. Alongside the training, a competitive  starting salary and benefits package is on offer and joining the company at this time of rapid expansion would give the opportunity to play an integral part in the bright future for the company. Please get in touch if you would like to hear more about this opportunity. Thank you for your interest - \"it's about people, not sales!\" ", "Salary": "£650.00 - £700.00 per day", "Location": "London", "Contract": "Permanent, full-time"}, "40592384": {"Description": " Senior Data ScientistLondon£65,000 - £75,000THE COMPANYHarnham are currently partnering with a leading fintech company who are currently hiring for a Senior Data Scientist to join the business. This business are one of Europe's leading payment providers and enjoy a growing reputation in the data science space.  You will join a centralised data team at the heart of the business, responsible for delivering statistical modelling and machine learning to many key areas, from payments, pricing, marketing and customer, fraud, commercial.  You will be expected to deliver production-level machine learning, and work closely with engineers, collaborating closely to deliver impactful data science. YOUR SKILLS AND EXPERIENCEYou must have:  An MSc in a quantitative discipline (e.g. statistics, physics, mathematics)Experience in using machine learning and statistical models to improve product performanceEnd to end problem solving experienceStrong knowledge of Python and SQLExperience in AWS is a bonusExperience in software engineering best practice also welcome. THE BENEFITS~ £75,000 + BenefitsHOW TO APPLYPlease register your interest by sending your CV via the Apply link on this page. For more information about this role, or similar machine learning positions, please get in touch with Nick Mandella at Harnham. KEYWORDSPython, SQL, Machine learning, statistical modelling, data scientist, data science, engineering, software engineering.  ", "Salary": "Competitive salary", "Location": "Hertfordshire", "Contract": "Permanent, full-time"}, "40607291": {"Description": " NLP Data Scientist London Up to £70,000 Our start up client working next gen tech is looking to add an NLP Data Scientist to their team. Reporting to the CTO and working in a small but collaborative team, you will be working on their knowledge management platform. Now that the dataset is cleansed  and prepped, they are looking to bring on an NLP Data Scientist to create the data models. You will be excited by working in an autonomous start up culture, have a problem-solving approach to your work and have a real passion for all things NLP! We are recruiting  and onboarding remotely for this role, in the long term you can expect a flexible working approach and working with exciting next gen tech! Experience  Master's degreeNLP experience within a production environmentStrong Python programmingLibrary experience eg. PyTorch, gensimComputational Linguistic knowledgeFamiliarity of Knowledge GraphsPyTorch, Spacy, TensorFlow experience If this position sounds exciting to you, please apply now!  Real Time are acting as an employment/agency business in relation to this vacancy. ", "Salary": "£40,000 - £50,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40587228": {"Description": " PRODUCT DATA SCIENTIST - NLP POWERED APP LONDON - Flexible and home working available.  £70,000 Superb opportunity to join a high growth start up who're already shaking up the personal finance and fintech markets massively. Through the brands innovative AI features, they've worked with over 3 million customers globally and have achieved a licence to  operate in both the US and Canada which is forecasting to be a lucrative territory in the coming years. WHAT YOU'LL BE DOING This position is business critical as you will the enabling the business to make better data driven decisions across product, marketing and commercial operations. You will be working amongst a team of 6 data experts and play a vital role in the productionising  of models that feed directly into the product. These tasks include:  Build key Product Metrics and analyse user behaviour.Conduct regular a/b tests to optimise user journey on both app and desktop.Building user segmentation, marketing attribution and customer lifetime value models to optimise customer personalisation and targeting.Above all, you play a vital role in translating your analysis into actionable insights which will have a real business impact in a fast-growing market. WHAT YOU NEED  Excellent coding ability in SQL with experience working with millions of rows of dataAdvanced modelling skills in one or more of the following: SAS/R/PythonMarketing Attribution or Product analytics experienceA degree or higher in a numerical disciplineFantastic stakeholder skills BENEFITS  A salary of up to £70,000 based on experienceExtensive benefits packageCompany discountsFlexible working HOW TO APPLY Please register you interest by sending your CV to Jamie Smith via the apply link on this page. This client is conducting a virtual process and onboarding. ", "Salary": "Competitive salary", "Location": "London", "Contract": null}, "40601954": {"Description": " Lead Data Scientist - FinTech We have an amazing opportunity to join a startup FinTech business, and be the first founding Data Scientist within the business which will allow a huge scope to scale this area out within the business. This is a very financially well backed with large plans,  looking to add to the disruption within the financial services space. The Co-Founders ex-silicon valley and have a strong track records or building successful tech teams. You will be spearheading the design and implementation of solutions created via the Data Science platform. Developing innovative algorithms and data models to gain real insight into consumer financial data to make a real difference to customers. They are looking for someone with a background in: ·Designing and building machine learning algorithms ·Coding in Python, Java or R ·Working with large data sets - data extraction, cleansing, analysis and presentation ·Familiarity with relational SQL databases and NoSQL databases ·XML and related technologies ·Cloud Infrastructure (AWS, Azure or GCP) ·MsC or PhD education in relatable field - Statistics, Computer Science, Data Science, Mathematics It would be very useful if you had the following experience but not essential: ·Leveraging big data technologies on Hadoop platforms ·Working for a FinTech / Challenger Bank There is a very strong package on offer, including equity within the business. If being involved at an early stage and really having ownership and freedom to deliver Data Science solutions sounds interesting, then please do apply! This job ad was posted by Salt. To find out more about Salt's Privacy Policy and how your application is processed, please visit our website https://privacy-policy/. ", "Salary": null, "Location": null, "Contract": null}, "40591674": {"Description": " Product Data Scientist London From £50,000-£75,000 depending on experience An innovative FinTech who have received millions in funding over the last year are seeking to expand their Data Science function. This brand have a product that helps their customers better manage their money and they now have millions of customers globally.  You will work on advanced data science products, help the C-Suite understand customer insight and commercial analytics.  If you are technically savvy in SQL and Python, with the ability to analyse millions of rows of customer data to create commercial insights for a business and increase marketing effectiveness, then this could be the next step in your career. Product Data Scientist  Daily use of SQL and Python with a focus on building statistical models (machine learning, churn, regression, propensity, attribution)Analysing the performance of products and analysing marketing trends to inform business strategies Delivering insights and recommendations to diverse stakeholders both internally and externally on how to increase performance, conversion and product diversificationYou will work on digital projects as well including A/B testingYou will work on customer retention and acquisition strategiesYou will present visualisations on Tableau  You don't have to tick all of the boxes but some of the following would be relevant:  You will have commercial experience in SQL, Python and product analyticsYou will have experience within customer insight and marketing functionsIdeally you will have experience analysing customer, transactional and/or online data  Salary and Benefits The successful candidate can expect to earn up to £70,000! In addition, they have one of the best discretionary bonus systems in the industry, a healthcare package, flexible hours and numerous team benefits e.g. socials and sports clubs. ", "Salary": null, "Location": null, "Contract": null}, "40525979": {"Description": "Our client is looking for a Data Scientist / Machine Learning Engineer to work at the cutting edge of Natural Language Processing (NLP). They are looking for someone who has a genuine passion for NLP and who has an engineering mindset to take the latest  advancements and apply them to real-world problems.The RoleThe role of Data Scientist / Machine Learning Engineer is hands-on with the data and product every day. You will:•   Understand business needs, researching and brainstorming models and ensembles that will help solve the problem•    Design, implement and maintain Machine Learning Model Pipelines•    Experiment with different models and measuring performance and selecting solutions•    Research and share the latest developments in Natural Language Understanding and NaturalLanguage Generation•    Define infrastructure requirements and architecture for Model Training and Inference•   Work closely as a part of the software development team to ensure models are effectively leveraged in the productThe CandidateThey are looking for someone that will be a great fit for the role and the team. If that's you, you will be:•    Will be passionate about NLP Technology and enjoy monitoring the latest developments and papers•    Have an engineering mindset to solve real problems•   Have good Python Development experience working with software at all stages of the development lifecycle•    Have deep experience using AI platforms including Pytorch, Tensor flow & AWS Sagemaker•   Be able to demonstrate direct experience in developing machine learning models and taking them through to production•   Have practical knowledge of the latest transformer language models such as Bert, Roberta, GPT2 etc and NLP Open Source Libraries e.g. Hugging Face, AI2, OpenAI, Spacy etc•    Have direct experience of working on conversational interfaces•    Have a scientific / statistics background (Sciences, Math, Engineering)ALL APPLICANTS MUST BE FREE TO WORK IN THE UK FREE FROM THE RESTRICTIONS OF VISA`S AND WORK PERMITS.Exposed Solutions is acting as an employment agency to this client.Please note that no terminology in this advert is intended to discriminate on the grounds of age, and we confirm that we will gladly accept applications from persons of any age for this role", "Salary": null, "Location": null, "Contract": null}, "40568565": {"Description": " Data Scientist£75,000 - £80,000London THE ROLE Harnham are currently working with an award-winning InsureTech start-up who are currently earning a lot of recognition for their work, and revolutionising their industry whilst they do it! As a business they focus their efforts on real-time machine learning for the good of the customer.  You will join as a key member of the team and work closely alongside both Data Scientists and Engineers to develop a market-leading pricing product. SKILLS AND EXPERTISE You will:  Build cutting-edge machine learning models which will be deployed and run in real-timeHave a huge variety of very rich data to work withWork with Python, PySpark, AWS, KubernetesHave a passion for deploying robust and scalable AI solutionsHave an interest in working closely with engineers, helping to drive the companies \"build\" mentality! HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Nick Mandella at Harnham. SALARY You can earn up to £80,000 + Options. KEYWORDS Python, Pyspark, spark, kubernetes, SQL, AWS, Machine Learning, Data Scientist, Data Science, ETL, Engineering, Scalable solutions, deployment.  ", "Salary": null, "Location": null, "Contract": null}, "40457074": {"Description": " We have an amazing opportunity to join a global powerhouse becoming a Lead Data Scientist within the business which will allow a huge scope to scale this area out within the business. This is a very financially well backed with large plans, looking to add  to the disruption within the financial services space. You will be spearheading the design and implementation of solutions created via the Data Science platform. Developing innovative algorithms and data models to gain real insight into consumer financial data to make a real difference to customers. They are looking for someone with a background in: Applied knowledge of several data technologies, practices and analytical approaches, for example:      Modelling (Statistical techniques, machine learning, text analytics, NLP)Modelling Packages (Pandas, Scikit Learn, NLTK, Spacy, Spark ML)Reporting and Visualization (Tableau, QlikSense, matplotlib, seaborn, D3, networkx)Big Data and NoSQL (Hadoop, Spark, Casandra,)Data Preparation (SQL, ETL, Warehouse architecture, OLAP)Data Architecture (Modelling, policy and rules)   It would be very useful if you had the following experience but not essential:  Leveraging big data technologies on Hadoop platformsWorking for a FinTech / Challenger Bank There is a very strong package on offer, If being involved at an early stage and really having ownership and freedom to deliver Data Science solutions sounds interesting, then please do apply! This job ad was posted by Salt. To find out more about Salt's Privacy Policy and how your application is processed, please visit our website https://privacy-policy/. ", "Salary": null, "Location": null, "Contract": null}, "40598179": {"Description": " Job Title: Senior Data Scientist Do you want to make a difference by being part of a next-generation data processing and analytics platform in the cloud in a greenfield environment? Holland and Barrett are a successful business focusing on making people healthier and happier. We started  in 1870 and today, we are a highly profitable global Health and Wellness retailer with more than 1,000 shops worldwide, and we are the largest health and wellness retailer in the UK. You will join the Data Science and Analytics team in London. You will work closely with Data Engineers and Business Stakeholders to deliver products ranging from topics like supply chain optimisation to loyalty schemes. Long-term, you will collaborate on  optimising and automating the Data Science workflow to build the basis for our prescriptive analytics or artificial intelligence strategy where self-optimising solutions make independent, intelligent decisions. Holland and Barrett are committed to its transformation into a technology and data-driven business. We hired an outstanding CTO with a long history of success in turning retailers into technology-driven businesses. We are bringing together highly talented  and experienced people like yourself to build our data processing and analytics platform. We love the cloud, data, analytics and data science, and building our own solutions. We embrace the continuing evolution of Data Science and want to be at the forefront  of building repeatable, automated Data Science and Machine Learning solutions to reduce or remove the Data Scientist's efforts on time-consuming, low impact, repeat tasks. You have experience in solving real-world problems with machine learning using a variety of tools. You know how to solve a problem as well as how to deploy it into production, measuring and updating it as needed over time. You love working closely with data  engineers and others in cross-functional teams to develop solutions iteratively. Importantly, you are pragmatic and experienced, able to identify and solve common problems swiftly and effectively with tools and libraries and you don't reinvent the wheel. The Person Key Accountabilities   Business Collaborate with business and other stakeholders.Communicate complicated results in a clear, non-statistical way to stakeholders.Identify quick wins and long-term opportunities.Help plan delivery.Converting Business problems into Data Science projects. Data Exploration and ad-hoc preparation.Feature engineering.Collaboration with Data Engineers for automation or additional ingests. Machine Learning Define metrics and measures.Identifying relevant algorithms and libraries.Selecting candidate algorithms based on experience and knowledge.Prototyping solutions to narrow options and parameters.  People Skills  ResilientOpen mindedCollaborativeSupportivePositiveConscientiousFun Technical Skills  Minimum 3 years of experience in a comparable role.Analytical background and degree, e.g. Math, Data Science, etc.Essential skills and experience  Data querying with Python or R and SQLProficient in R or PythonSupervised and unsupervised machine learningSpark (SparkR / sparklyr or pyspark)StatisticsPackaging Code GitBuilding / Maintaining Automated Production Systems Beneficial experiences  Software Development practicesCloud ComputingDistributed ComputingAWS (SageMaker, Airflow, Kafka, etc.)Machine Learning for Streaming DataRetail sectorManagement Experience  ", "Salary": null, "Location": null, "Contract": null}, "40583526": {"Description": " Data Scientist - ChatbotRemote6-month Contract£700 per dayAs a Data Scientist, you will be required to build a state-of-the-art chatbot that will recognise voice and text dialog. You will be working for an advanced technology company, working for their clients in the retail sector. THE COMPANY:This company are a specialist consultancy in the retail sector. They build Data Science products to enhance client performance, whether that be predictive models for pricing, optimisation models for storage space or chatbots for their websites. The company  has specialist teams in NLP, AI and Data Science. They require a chatbot expert to implement a prototype for their clients. THE ROLE:As a Data Scientist you will be responsible for building an advanced AI chatbot for several retail clients. Ideally, you would have experience using Google Dialog to model the required Decision Trees so that the chatbot can give relevant responses. You will  be working with the most cutting-edge technologies and building this model from scratch. If you have expertise with NLP and have worked on chatbots previously, this role is perfect for you. YOUR SKILLS AND EXPERIENCE:The ideal Chatbot Data Scientist will have:  Experience creating chatbotsExpertise working with NLP technologiesCome from a Software backgroundA Masters or PhD HOW TO APPLY:Please register your interest by sending your CV via the Apply link on this page. ", "Salary": null, "Location": null, "Contract": null}, "40578225": {"Description": " NLP Scientist | Data Scientist in NLP | Deep Learning | InsurtechYour new companyYou will be working for a global financial giant, who are growing out their AI team in order to develop forward thinking products that use AI. Through disruption, Machine Learning and Research and Development this team are creating solutions and innovations  to change how business is done both internally and externally, with a hope to disrupt the wider insurance industry.Your new roleAs a NLP Scientist you will be critical to the success of these projects, as they are at the core of building these new products. In this role, you would be enjoying state-of-the-art research as you look to employ deep learning algorithms and find patterns  in multi-modal data.What you'll need to succeedThis role is ideal for recent PhD graduates looking to get stuck into cutting-edge research and development, as well as senior candidates who are looking to mentor junior employees.If you have experience in:  An advanced degree in a numeric discipline, ideally PhD level (e.g., Statistics, Machine Learning, Computer Science, Engineering, and Physics).Exposure to core NLP and text analytics tasks and application areas.Hands-on Deep Learning experience (e.g., architecture design in CNN/RNN/LSTM, optimization, etc).High-level programming (e.g., Python, C++ or Java/Scala) and computing technologies (high-performance computing, e.g., CUDA).Exposure using existing deep/machine learning libraries (e.g., TensorFlow, Torch, scikit-learn, or other).Knowledge with existing Open Source NLP libraries.Track record of employing deep learning in a commercial setting with product development teams.Published records or papers in top machine learning and NLP journals and conferences.High-level stakeholder management and communication skills. What you'll get in returnYou will be remunerated with a very competitive salary and benefits package, as well as the opportunity to work and develop alongside some of the most prominent minds in NLP research. You will also have the opportunity to represent the firm at NLP conferences  and journals.What you need to do nowIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV. Please do not hesitate to apply - this firm is actively interviewing. This role does not have a defined salary bracket as the firm are willing to remunerate based  on the candidates skills, and are looking for both entry level and experienced candidates. Hays Specialist Recruitment Limited acts as an employment agency for permanent recruitment and employment business for the supply of temporary workers. By applying for this job you accept the T&C's, Privacy Policy and Disclaimers which can be found at hays.co.uk ", "Salary": null, "Location": null, "Contract": null}, "40477772": {"Description": "Site Name: USA - Pennsylvania - Upper Providence, UK - Hertfordshire - StevenagePosted Date: Jun 23 2020We are seeking a genomic data scientist with a track record of supporting innovative, high quality research by managing and analyzing large volumes of genetic and genomic data and results in a distributed database and analytical environment. GSK aims to improve the number of successful late stage clinical trials for innovative medicines, by both identifying and advancing drug targets that have strong evidence of a causal role in disease biology. The Human Genetics team leverages major scientific  and technological advances, including investment in biobanks linked to large-scale human health databases, cutting-edge informatics platforms, breakthrough understanding of biological pathways, functional genomics capabilities built upon rapid progress in  gene editing, and leading industry-academia partnerships, in order to identify the best targets and to continue evaluation of targets through their life in the pipeline. The successful candidate will work in a multidisciplinary, collaborative and scientifically driven environment, interacting with GSK scientists and key academic collaborators to advance drug discovery and clinical development in multiple disease areas. This  research will leverage industry-leading data and compute resources, to address important drug discovery and development challenges, to directly impact GSK’s R&D pipeline, and to publish in top scientific journals. The selected Genomic Data Scientist(s) will:  Develop and implement robust software platforms to efficiently ingest, curate, query and analyze, human genetic, genomic, and clinical/phenotypic data, to inform target selection and validation decisions across a range of disease areas.Leverage the opportunities and efficiencies afforded by access to hybrid cloud-based, distributed ecosystem of technologiesParticipate in project teams of GSK scientists and external collaborators to develop novel genetic data analyses, providing and following best practices of efficiently work with large volumes of data on modern storage and computational platforms.Guide creative solutions to challenging scientific questions from early proof-of-concept stages to production deploymentsDevelop analytics tools and applications to enhance the productivity of scientists within Human Genetics and across the Research organization. Why you?Basic Qualifications: We are looking for professionals with these required skills to achieve our goals:  Masters or equivalent experience in genetics, bioinformatics, or related life sciences applications.Enterprise, industry experience in SQL and either R or Python software development, with track record of developing production quality software pipelines, applications, or packages/libraries.Experience working in a distributed data and compute environment (e.g. Apache Hadoop ecosystem). Experience with Apache SparkTM is a significant advantage.Proficient in management and analysis of large volumes of genetic/genomic data and resultsExcellent communication and influencing skills and developing leadership skills for working with multidisciplinary teams and with international colleagues. Preferred Qualifications: If you have the following characteristics, it would be a plus:  Ability to discuss genomic data types and analyses used in early target discovery.Experience with data and/or results from large scale genetic association studies (e.g. GWAS or PheWAS) or large scale functional genomic data.Experience with complex longitudinal human clinical/phenotype data, e.g.  from electronic health records, epidemiological cohorts, or clinical trials. Why GSK? Our values and expectations are at the heart of everything we do and form an important part of our culture. These include Patient focus, Transparency, Respect, Integrity along with Courage, Accountability, Development, and Teamwork. As GSK focuses on our values and expectations and a culture of innovation, performance, and trust, the successful candidate  will demonstrate the following capabilities:   Agile and distributed decision-making – using evidence and applying judgement to balance pace, rigour and risk.Managing individual and team performance.Committed to delivering high quality results, overcoming challenges, focusing on what matters, execution.Implementing change initiatives and leading change.Sustaining energy and well-being, building resilience in teams.Continuously looking for opportunities to learn, build skills and share learning both internally and externally.Developing people and building a talent pipeline.Translating strategy into action - a compelling narrative, motivating others, setting objectives and delegation.Building strong relationships and collaboration, managing trusted stakeholder relationships internally and externally.Budgeting and forecasting, commercial and financial acumen. GSKGenetics As a company driven by our values of Patient focus, Transparency, Respect and Integrity, we know inclusion and diversity are essential for us to be able to succeed. We want all our colleagues to thrive at GSK bringing their unique experiences, ensuring they  feel good and to keep growing their careers. As a candidate for a role, we want you to feel the same way. As an Equal Opportunity Employer, we are open to all talent. In the US, we also adhere to Affirmative Action principles. This ensures that all qualified applicants will receive equal consideration for employment without regard to race/ethnicity, colour,  national origin, religion, gender, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class*(*US  only). We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are. Please don’t hesitate to contact us if you’d like to discuss any adjustments to our process which might help you demonstrate your strengths and capabilities. You can either call us on, or send an email  As you apply, we will ask you to share some persona", "Salary": null, "Location": null, "Contract": null}, "40588986": {"Description": " Data Scientist - FinTech - Dubai  Data Idols are working with a Start-up FinTech company who are looking for a Data Scientist to join the team. The role will intially be remote from the UK but then the candidate will need to relocate to Dubai once restrictions are lifted.  THE ROLE Within this Data Scientist role you will apply statistical models to understand customer behaviour and to plan and gather relevant data to build strong insights. YOUR SKILLS AND EXPERIENCE:  Using machine learning techniques for Risk, NLP, Recommenders and behavioural analysisDeveloping and productionising unique ways to analyse and draw results from the Fintech companies large data setsYou have strong technical skills in Python This is an outstanding opportunity for a Data Scientist to join an exciting company on a permanent basis with a great salary and benefits package. Please submit your CV for consideration and further details. Data Scientist - FinTech - Dubai  ", "Salary": null, "Location": null, "Contract": null}, "40549328": {"Description": " A leading Games Studio based in London is looking for an Experienced Senior Data Analyst to join their rapidly expanding team. This candidate will sit within its expanding Growth and Insights team and play a fundamental role in providing Data Driven insights  to all stakeholders.   Key responsibilities for the Senior Data Analyst/Scientist:   Support data-driven decision making for future games based on studies of player trendsDesign and conduct AB testsProvide support to other data team members, such as iterating analysis task briefs and conducting code reviews Share insights with fellow team members and company stakeholders Required Skills for the Senior Data Analyst/Scientist:  A minimum of 3 years’ experience performing statistical analysisPrevious experience within the Gaming sectorExpertise in SQL and PythonFamiliarity with cloud based computing systemsExperience with LinuxFamiliarity with Agile working practices and gitStrong interest in gaming The salary bracket for this role is £40,000 - £50,000 with interviews commencing ASAP. If this role is of interest or you require more information, please get in touch with an updated CV to or call on to discuss further.We also offer a referral fee for successful placement, so if someone you know is suitable, please also get in touch. ", "Salary": null, "Location": null, "Contract": null}, "40579299": {"Description": " JOB TITLE: Data Scientist - Google Data Studio LOCATION: West London SALARY: Freelance - Day rate OVERVIEW: We are working with an exciting Digital Agency who has won countless Google awards. With lots of exciting new projects being won, they are looking to expand their Data Science team with someone who is an expert with Google Data Studio, Python and BigQuery. They are a fully integrated digital and creative agency offering Paid Search, Paid Social, PPC, SEO, Amazon, Display and Shopping working with some of the largest global brands.  They are now looking to expand their team and bring in an experienced Data Scientist. REQUIREMENTS: Must Haves:  In-depth understanding and practical expertise of Python programming. Expertise with Google Data StudioExperience with SQL or BigQueryExperience working with Google Adword and Google AnalyticsPredictive Modelling experienceExcellent analytical and problem-solving skills Nice to Haves  Database Schema AnalysisData Warehousing BENEFITS: The role comes with an excellent day rate of which will be negotiated. The company is growing and with this comes great opportunity to develop. NEXT STEPS: If this is the right opportunity for you then please apply to this advert with an updated copy of your CV or contact Martin Shardlow - KRG Creative -  www.krgcreative.co.uk All applications are dealt with in the strictest of confidence ", "Salary": null, "Location": null, "Contract": null}, "40565289": {"Description": " Actuarial Data Scientist Manager, Central London based and up to £115,000. Requirements: - Extensive actuarial pricing experience- Proven experience implementing data science techniques within organisations If you're interested and would like more information, please apply or get in touch directly for a confidential discussion.  ", "Salary": null, "Location": null, "Contract": null}, "40547797": {"Description": " This team sits within a global communications agency, their goal to use research in order to change behaviour for good in fragile and conflict states. Working across education, environment, gender, prejudice and health in some of the most challenging communities  their highly sophisticated research programmes are creating change. This is a team that works in international development so clients range from governments to foundations and almost all is international. We are now looking for someone with 18mths experience  to join them - you should have a strong analytics/statistics background and be interested in pursuing a career in data science. The culture is dynamic and fast paced so you should have experience of working in a project environment - ideally in an agency and  have an interest in international development. ", "Salary": "£70,000 - £75,000 per annum", "Location": "Berkshire", "Contract": "Permanent, full-time"}, "40526500": {"Description": " Epson is a global imaging and innovation leader that operates at the cutting edge of technology development. We are dedicated to exceeding the vision of customers worldwide through the creation of ground-breaking, high-precision and energy-saving technologies.  From printers and 3LCD projectors, to wearable GPS/activity monitors and augmented reality smart glasses, Epson offers an extensive array of award-winning products to customers across the world. Epson are seeking to recruit a proactive and detail-orientated Data Scientist to support our successful Subscription team. Reporting into the Customer Success Manager, the successful candidate will work closely with a range of key stakeholders, undertaking  analysis of customer and external data to provide a data driven insight into customer behaviour, onboarding preferences and patterns, resulting in optimisation of user experience for the Subscription business. This role is based out of our Sales and Marketing Offices, in Hemel Hempstead, UK with some travel across Europe. Key Responsibilities:  Actively contribute to the subscription proposition success by making its acquisition and retention strategies as effective as possible thanks to a deep understanding of its end users' behaviourAnalyse large amounts of information via state-of-the-art data mining methods (and present results in a clear manner using data visualisation techniques) to; -Provide a better understanding of how the subscription business performs -Track subscription performance by introducing and monitoring the most pertinent KPI's -Discover trends and patterns to be used to support the user experience  Support the AI tools definition for the automation of the actions required to successfully implement the Subscription acquisition and more importantly retention strategiesUse (and/or supports the building) of predictive models and machine-learning algorithms to increase and optimise customer experiences, revenue generation and profitability improvementVerify the integrity of data used for analysisCreate, use and maintain the automated anomaly detection systemsAssess the effectiveness of data sources and data-gathering techniques and improve data collection methodsDevelop A/B testing framework and test model qualityCoordinate with different functional teams to implement models and monitor outcomes to drive subscription adoption increase and/or retention improvements Knowledge, Skills & Experience:  Proven experience in data mining and statistical analysis in marketing/sales areasEducated to Bachelor's degree level in relevant fields (i.e. Computer Science, Statistics, Applied Math)Experience using SQL language to manipulate data and draw insights from large data setsExperience in coding languages such as PythonKnowledge of statistical techniques and concepts (regression, properties of distributions, statistical test, etc.)understanding of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.)Experience using web services (Redshift, S3, Spark, DigitalOcean, etc.)Good understanding of AB testing methodologiesCapacity to integrate own activities into wider project management streams (both in waterfall and agile approaches)Good interpersonal communications skillsNumerate, excellent attention to detail, analytical and accurateProblem-solving aptitudeExcellent knowledge of MS word, PowerPoint and ExcelIdeally a good understanding of subscription models, in-store services activations via cards, with retailers across Europe Epson makes products for a wide range of customers and we are committed to having a diverseworkforce. We offer a competitive salary and with an outstanding suite of benefits. Colleagues based in our offices at Westside, Hemel Hempstead work in an excellent waterside location with close proximity to Apsley train station, onsite parking and a subsidised  restaurant. ", "Salary": "Competitive salary", "Location": "Middlesex", "Contract": "Permanent, full-time"}, "40589725": {"Description": " Lead Data Scientist - CONTRACT RATE - Dependant on experience TERM - 3 months (ideally converting to perm) LOCATION - Central London TEAM Having built most of the existing Marketing Sciences function, we can vouch for the exceptional quality of talent this agency has managed to attract; not just because of the complexity of data science projects on offer, but also because of the vision of  their Marketing Sciences Director. He is passionate about training and development and has built a strong culture of collaboration and innovation. Every single person we’ve placed, LOVES their job and more importantly, LOVES their team! The work life balance  is excellent and there is an adult working environment where you are trusted to deliver and given the freedom to manage your own time. ROLE In this (ideally) temp to perm role, you will not only manage a team of Data Scientists, but you can also apply your skills across a variety of cutting edge data science projects including heat mapping, digital automation and attribution, NLP, computer vision,  advanced predictive analytics, machine learning and AI / automation, whilst working closely with the Head of Data Science to develop the offering and capabilities within the team. You will work closely with huge brands to shape analytical roadmaps, scoping data science and insights projects, leading your team to delivery as well as getting your hands dirty with high level, complex analytics yourself.You will work closely with the Head of Data Science to evolve and grow the data science offering for this leading data driven customer engagement agency, contributing to pitches and presenting simple and compelling solutions to complex client problems. You  should be highly skilled in the latest data science and statistical insights techniques in order to inspire and lead your team on a daily basis, QA-ing work and leading on the best methodologies and approaches to take. Skills and experience required:  Educated to degree level in a numerate subject; Mathematics, Statistics, Engineering, Physics, Chemistry, Economics, Machine Learning, Computer Science etc.A background in predictive modelling, segmentation and statistical analysis, including the delivery of actionable insights, in a marketing environmentStrong programming experience with Python AND SQL as a minimumAbility to gather and scope requirements for a variety of analytical projectsExperience with machine learning techniques and a modern approach to omnichannel marketing analysis techniquesA mix of skills across the following disciplines: Data engineering and Big Data Technologies (Spark, Hadoop, Hive, Apache Beam, Redshift, BigQuery), cloud computing, marketing mix modelling / econometrics, web clickstream analysis, Computer Vision, building  recommendation engines,Ability to engage with senior level client stakeholders and operate at a senior level on projects TO APPLYFor further information or to apply please contact:Kate McDermott - Managing Consultant @ Blue Pelican Marketing Share through your CV to Text me on Share through your LI profile if you’re non-active and simply curious You don’t have to have a CV to find a new job! We’re always keen to talk to good data experts.For more vacancies which may suit your needs, please visit us at www.bluepelican.com ", "Salary": "Competitive salary", "Location": "London", "Contract": "Permanent, full-time"}, "40602014": {"Description": " Senior Data Scientist - Forecasting - Permanent Data Idols are working with a very well know Global Retailer who are looking for a Senior Data Scientist to join an existing data team.  THE ROLE As a Senior Data Scientist you will be working with the existing Data team to help develop and deploy forecasting models. You will be working in an exciting environment to optimise the output of the business. This Senior Data Scientist role will allow you  expand and utilise your skills.  YOUR SKILLS AND EXPERIENCE  Experience developing and deploying forecasting modelsCommercial experience in Python and SQL Have strong knowledge of querying databases  This is an outstanding opportunity for a Senior Data Scientist to join an exciting company on a permanent basis with a great salary and benefits package. Please submit your CV for consideration and further details. Senior Data Scientist - Forecasting - Permanent ", "Salary": "£60,000 - £80,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40568572": {"Description": " Data ScientistEnergy TradingLondon£100,000 + Bonus + Benefits THE COMPANY Harnham are working with a London-based financial services firm who are hiring a Data Scientist to work on a range of energy trading problems. In this role you will use machine learning to research and build new products, making use of alternative data assets and the latest techniques. SKILLS AND EXPERTISE You will have:  A deep knowledge of machine learning and statisticsExcellent programming/coding abilities in Python An MSc or Ph.D. in a quantitative subjectKnowledge of visualisation techniques and tools like tableau, Qlikview, Angular, D3, Spotfire.  SALARY DETAILS £100,000 + Bonus + Benefits HOW TO APPLY To be considered for this opportunity, please submit your details using the 'Apply' button on this page. For more information about similar opportunities please contact Nick Mandella at Harnham. KEYWORDS Data Scientist, Data Science, Machine Learning, statistics, Python, financial services, energy trading.  ", "Salary": "£60,000 - £65,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40510070": {"Description": "Site Name: UK - London - BrentfordPosted Date: Jul 14 2020Principle Data Scientist - Sales & Marketing  Job Purpose This is an exciting opportunity to join and support GSK Consumer Healthcare in its journey to becoming a more data driven organisation. This means providing our teams with easy access to relevant and timely data to inform faster and more insight driven decision  making. In addition, this will enable faster feedback on the impact of change as the organisation undergoes agile transformation and transition to a ‘test and learn’ approach. Data is a key tenet underpinning our transformation journey following the joint  venture with Pfizer this year and our 3-year plan to spin off into a separate company. It is a unique opportunity to help in the build of a team of highly skilled Data Scientist where you will be discovering the value in data that others can’t see. You will be exploring cutting edge ML techniques to discover patterns and predictions that change  the way we think about our business. You will help lead complex and diverse projects to leverage Data Science techniques which will result in measurable commercial benefit. You will be working closely with marketing team, strategy team and external vendors. An opportunity to champion our Data For Good agenda through sustainable projects and pro-bono charity work. This role is ideal for a person who can provide leadership and vision to transform the organisation to a product and value led mindset. They will have a strong understanding in Medium Mix and Marketing Consumer. They will be confident in working in partnership with senior stakeholders from across the business. They will use their extensive scientific background to discover business value across our extensive data landscape. Applicants should be experienced in leading teams and in providing ongoing coaching and oversight over the development of data products through an agile methodology. In addition, a strong strategic and business outcomes focused skillset is required to be  able to identify and assess value, in order to prioritise delivery in line with the business needs. You will be seen as a leader in your specific academic discipline and your thought leadership will command attention in the wider data science community. Key Responsibilities  People & Team Management  As a Principal Data Scientist, you:  Contribute to hiring and building a great pool of Data Scientists for your team and support the recruitment activities of other data functionsMotivate, inspire, coach, mentor colleagues within the Data Science team to help them develop technical excellenceMotivate, inspire, coach, mentor business partners and stakeholders to help them identify new transformational possibilities that Data Science enables Where applicable (if managing people):Define clear objectives for each individual you manageEnsure each individual you manage has a personal development plan and regularly proactively works on it.Carry out people routines for direct reportsSupport and mentor Data Scientists with direct reports in their role as line managers Functional Requirements  As a Principal Data Scientist, you:  Contribute to all aspects of the Data Science Project LifecycleCan coordinate and manage competing priorities across a portfolio of projectsProvide leadership and guidance on monitoring data quality to improve confidence in the data used for analysisOwn and define the key performance indicators (KPIs) and diagnostics to measure performance against business goalsCompile, integrate, and analyse data from multiple sources to answer business questionsAre experienced in Agile methodologies and the hypothesis-driven approachHave the ability to conceptualize, formulate, prototype and implement algorithms to capture customer behaviour and solve business problemsProven extensive experience developing and implementing Machine Learning algorithms from large data sets which have been structured and unstructured.Be an expert in mining large & very complex data sets using SQL, Hadoop, NoSQL and Spark.Have an in depth understanding of statistical modelling techniques such as deep learning, applied AI and reinforced learning Domain Expertise  As a Principal Data Scientist, you:  Have an advanced knowledge level of the Data Science ToolsHave a strong understanding in Medium Mix and Marketing Consumer.Set up, configure and optimize Data Science technology environmentsAre experienced at using Big Data and Cloud environments and common Data Science toolkitsHave a deep knowledge of a sufficiently broad area of technical specialism (e.g. Machine Learning, Optimisation, Applied Mathematics, Simulation, etc.), and are a valued and trusted expert Why GSK? Our values and expectations are at the heart of everything we do and form an important part of our culture. These include Patient focus, Transparency, Respect, Integrity along with Courage, Accountability, Development, and Teamwork. As GSK focuses on our values and expectations and a culture of innovation, performance, and trust, the successful candidate will demonstrate the following capabilities:   Agile and distributed decision-making – using evidence and applying judgement to balance pace, rigour and riskManaging individual and team performance.Committed to delivering high quality results, overcoming challenges, focusing on what matters, execution.Implementing change initiatives and leading change.Sustaining energy and well-being, building resilience in teams.Continuously looking for opportunities to learn, build skills and share learning both internally and externally.Developing people and building a talent pipeline.Translating strategy into action - a compelling narrative, motivating others, setting objectives and delegation.Building strong relationships and collaboration, managing trusted stakeholder relationships internally and externally.Budgeting and forecasting, commercial and financial acumen. As a company driven by our values of Patient focus, Transparency, Respect and Integrity, w", "Salary": "£70,000 - £800,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40509055": {"Description": "NLP Data Scientist (Python PhD). *Remote Interview*. Do you have expertise with NLP and Deep Learning? You could be utilising your skills and learning about financial trading strategies at one of the world's leading Investment Management companies. As an NLP Data Scientist you will work with a small team of Data Science experts to build and refine algorithms that can find useful patterns in large multi-modal data and use this to form strategies to disrupt the current practice in investment and insurance.  You'll use your findings to present the business with new product ideas, data driven applications, insights and strategies and then develop and implement them, coding in Python. You'll be based in modern, spacious City based offices with a range of facilities and a collaborative, upbeat environment. Driven by technology the company is able to offer a remote interview and onboarding process and work from home during the current social  distancing measures. Requirements:*Outstanding record of academic achievement including PhD in a numeric discipline (e.g. Statistics, Machine Learning, Computer Science, Engineering or Physics)*Significant experience with NLP and test analytics and it's application areas (e.g. text classification, topic detection, information extraction, Named Entity recognition, entity resolution, Question-Answering, dialog systems, chat bots, sentiment analysis,  event detection, language modelling)*Advanced knowledge of Deep Learning, particularly with hands-on experience in hyper-parameter tuning and deep construction / distribution (e.g., architecture design in CNN/RNN/LSTM, attention mechanisms, parameter initialisation, activation, normalisation,  and optimisation)*Strong Python coding skills (experience with C++, Java, Scala and HPC languages such as CUDA all nice to have)*Interest and desire to work on and learn about financial trading strategies and systems*Collaborative with strong communication skillsAs a NLP Data Scientist (Python PhD) you will earn a competitive salary (to £80k) plus benefits.Apply now or call to find out more about this NLP Data Scientist opportunity.", "Salary": "£60,000 - £75,000 per annum", "Location": null, "Contract": "Permanent, full-time"}, "40576757": {"Description": " Our client are a small but fast growing analytics company, focused largely on developing predictive and optimisation solutions for clients predominantly in consumer goods and services. They have already worked with several international brands in telecoms,  banking, retail, travel and consumer goods. They have a strong network through partnerships and some joint ventures in Europe and North America, offering a great opportunity to grow in the next 18 - 24 months. They are seeking a talented data scientist to join their organisation with engagements largely focused on revenue and supply chain analytics, through not constrained to this space. The role will provide:  a phenomenal opportunity to become heavily involved in and central to the organisations' growth plans over the coming 2 years, with a range of exciting commercial initiatives underway.scope to begin receiving performance-related incentives within the first 9-12 monthsscope to work remotely approximately 80% of the time (except where client engagements dictate regular physical onsite presence)an opportunity to discuss a LTIP (including revenue sharing / equity) within the first 12-18 months Initial focus of the role  Supporitng analytics consulting delivery on several analytics consulting engagements over the first 12-18 months The successful candidate will have an opportunity to work closely with partners and the CTO to attend high profile client meetings / pitches and support the business development cycle to broaden their experienceSupport the technical team (data scientist & developer) in analytics delivery to support product roll-out (planned for late 2020) Candidate preferences Applicants should ideally: - be performance and outcome focused, with an ability to work with a high degree of independence - ideally possess some prior experience of working on complex corporate analytics projects (not essential) - possess outstanding technical proficiency in R and / or Python and commonly used ML libraries - have a PhD in a Data Science/Machine Learning, Computer Science or a related quantitative fields ", "Salary": "Competitive salary", "Location": "Hertfordshire", "Contract": "Permanent, full-time"}, "40534358": {"Description": "Data Scientist (NLP Deep Learning Python PhD). *Remote Interview*. Do you have expertise with NLP and Deep Learning? You could be utilising your skills and learning about financial trading strategies at one of the world's leading Investment Management  companies. As an NLP Data Scientist you will work with a small team of Data Science experts to build and refine algorithms that can find useful patterns in large multi-modal data and use this to form strategies to disrupt the current practice in investment and insurance.  You'll use your findings to present the business with new product ideas, data driven applications, insights and strategies and then develop and implement them, coding in Python. You'll be based in modern, spacious City based offices with a range of facilities and a collaborative, upbeat environment. Driven by technology the company is able to offer a remote interview and onboarding process and work from home during the current social  distancing measures. Requirements:*Outstanding record of academic achievement including PhD in a numeric discipline (e.g. Statistics, Machine Learning, Computer Science, Engineering or Physics)*Significant experience with NLP and test analytics and it's application areas (e.g. text classification, topic detection, information extraction, Named Entity recognition, entity resolution, Question-Answering, dialog systems, chat bots, sentiment analysis,  event detection, language modelling)*Advanced knowledge of Deep Learning, particularly with hands-on experience in hyper-parameter tuning and deep construction / distribution (e.g., architecture design in CNN/RNN/LSTM, attention mechanisms, parameter initialisation, activation, normalisation,  and optimisation)*Strong Python coding skills (experience with C++, Java, Scala and HPC languages such as CUDA all nice to have)*Interest and desire to work on and learn about financial trading strategies and systems*Collaborative with strong communication skillsAs a Data Scientist you will earn a competitive salary (to £80k) plus bonus and benefits.Apply now or call to find out more about this Data Scientist (NLP Deep Learning Python PhD) opportunity.", "Salary": "£55,000 - £60,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40530293": {"Description": " Data Scientist - (Business Consultancy / Analysis) Excellent opportunity for a Data Scientist who is looking to move into more of a managerial/consultancy-focused position within an exciting startup. The company are a recently-formed collective of well-regarded Cyber Security thoughtleaders & AI specialists who are developing a unique cloud-based integrated security platform that will save businesses money, improve data security and monitor threats 24/7. Your role will see you acting as a specialist Data Scientist where you will work with companies to understand requirements and use your knowledge to ensure they get the most out of the product. Current clients include some of the largest Financial Sevices  companies in the UK and also numerous large-scale Tech firms worldwide. Key skills:  ** 3+ years' experience in Data Science ** Business Analysis or Project Management experience ** AWS Cloud Beneficial: ** Experience implementing AI/ML techniques If you are interested in the position please reply ASAP with an up-to-date CV. For any more info please get in touch. Data Scientist - (Business Consultancy / Analysis) For more information about Shift F5 and the opportunities we have to offer follow us on Twitter @F5_Jobs Shift F5 Ltd is acting as an Employment Agency in relation to this vacancy. ", "Salary": "£85,000 - £95,000 per annum", "Location": "London", "Contract": "Permanent, full-time"}, "40589742": {"Description": " Lead Data Scientist - CONTRACT RATE - £400 - £450 per day TERM - 3 months+ LOCATION - Central London TEAM Having built most of the existing Marketing Sciences function, we can vouch for the exceptional quality of talent this agency has managed to attract; not just because of the complexity of data science projects on offer, but also because of the vision of  their Marketing Sciences Director. He is passionate about training and development and has built a strong culture of collaboration and innovation. Every single person we’ve placed, LOVES their job and more importantly, LOVES their team! The work life balance  is excellent and there is an adult working environment where you are trusted to deliver and given the freedom to manage your own time. ROLE In this contract role, you will apply your skills across a variety of cutting edge data science projects including heat mapping, digital automation and attribution, NLP, computer vision, advanced predictive analytics, machine learning and AI / automation  and in particular web clickstream analysis and Big Data (working with Hive and Hadoop). You will work closely with a major global brand to shape analytical roadmaps, scoping data science and insights projects, supporting the team and delivering high level, complex analytics yourself.You will present simple and compelling solutions to complex client problems, and so should be highly skilled in the latest data science and statistical insights techniques in order to inspire and lead your team on a daily basis, QA-ing work and leading on the  best methodologies and approaches to take. Skills and experience required:  Educated to degree level in a numerate subject; Mathematics, Statistics, Engineering, Physics, Chemistry, Economics, Machine Learning, Computer Science etc.A background in predictive modelling, segmentation and statistical analysis, including the delivery of actionable insights, in a marketing environmentStrong programming experience with Python AND SQL as a minimumAbility to gather and scope requirements for a variety of analytical projectsExperience with machine learning techniques and a modern approach to omnichannel marketing analysis techniquesSkilled in web clickstream analysis and Big Data skills (esp Hive/Hadoop) is ESSENTIAL for this roleAbility to engage with senior level client stakeholders and operate at a senior level on projects TO APPLYFor further information or to apply please contact:Kate McDermott - Managing Consultant @ Blue Pelican Marketing Share through your CV to Text me on Share through your LI profile if you’re non-active and simply curious You don’t have to have a CV to find a new job! We’re always keen to talk to good data experts.For more vacancies which may suit your needs, please visit us at www.bluepelican.com ", "Salary": "£105,000 - £110,000 per annum", "Location": "London", "Contract": null}, "40565165": {"Description": " Leading UK Insurer is looking to hire a Senior Data Scientist to join an established team. The role will focus on applying Data Science and Machine Learning to create insights into Insurance Products that will help drive the strategic direction of the business. Salary: £60,000 -65,000 + Bonus + Benefits Location: City of London Data Scientis Leading UK Insurer is looking to hire a Senior Data Scientist to join an established team. The role will focus on applying Data Science and Machine Learning to create insights into Insurance Products that will help drive the strategic direction of the business. Salary: £60,000 -65,000 + Bonus + Benefits Location: City of London Data Scientist Role:  Develop advanced data science techniques to provide valuable insight and analytical services over diverse large scale data sets.Supports pricing team and wider businessManage end to end data science projectsDevelop new data products and insights that create actionable outcomes for the business Data Scientist Requirements:  Experience building predictive models using a wide variety of tools and techniques (e.g. linear or logistic regression, gradient boosted machines, random forest, regularisation, neural networks)MSc or PhD in computer science, engineering, physics, actuarial science, statistics or mathsExperience working with large data sets (e.g. dplyr, pandas, SQL, etc.)Programming experience in Python, R, SAS/WPS, MATLAB Working knowledge of any of the following:PyCharm, RStudio, Visual Studio Code, eclipse For more information please apply to this advert. Thanks!  t Role:  Develop advanced data science techniques to provide valuable insight and analytical services over diverse large scale data sets.Supports pricing team and wider businessManage end to end data science projectsDevelop new data products and insights that create actionable outcomes for the business Data Scientist Requirements:  Experience building predictive models using a wide variety of tools and techniques (e.g. linear or logistic regression, gradient boosted machines, random forest, regularisation, neural networks)MSc or PhD in computer science, engineering, physics, actuarial science, statistics or mathsExperience working with large data sets (e.g. dplyr, pandas, SQL, etc.)Programming experience in Python, R, SAS/WPS, MATLAB Working knowledge of any of the following:PyCharm, RStudio, Visual Studio Code, eclipse For more information please apply to this advert. Thanks!  ", "Salary": null, "Location": null, "Contract": null}, "40497140": {"Description": " Data Scientist (Cyber Security / AI startup) An exciting Tech startup based in London is looking an experienced Data Scientist to join the team. The company are a recently-formed collective of well-regarded AI Consultants & Cyber Security thought leaders who are developing a unique cloud-based integrated security platform that will save businesses money, improve data security and monitor threats  24/7. Already partnered with some of the world's leading Banks & Telcos, the business are growing rapidly and are hiring across the board. Key skills:  ** Python ** SQL ** AWS Beneficial: ** Experience implementing advanced AI/ML techniques If you are interested in the position please reply ASAP with an up-to-date CV. For any more info please get in touch. Data Scientist (Cyber Security / AI startup) For more information about Shift F5 and the opportunities we have to offer follow us on Twitter @F5_Jobs Shift F5 Ltd is acting as an Employment Agency in relation to this vacancy. ", "Salary": null, "Location": null, "Contract": null}, "40606176": {"Description": " My client a leading Fintech organisation are currently in the market for a Senior Data Scientist to come on board to join a new data practice.  This is an exciting opportunity to join a brilliant and sustainable organisation in a large growth period. You will be expect to do the following;  Building and deploying machine learning modelsDevelop, maintain and improve code and data science workflows for existing and new modelsOwn the automated test and deployment pipelines for data science servicesProvide thought leadership around how to enable the data science team to efficiently. To be able to develop and maintain ETL processes that feed from various data sources (SQL's, APIs etc.)Work with Data Engineer to successfully (end to end) deploy python on AWS cloud instanceMust have strong SQL skills. Key Skills Required:   Work independently and generate production-level Python modelsStrong understanding and experience with relational databases (such as Oracle, MySQL) and the SQL language are requiredHands on experience with cloud based systems and data science pipelinesGood understanding of operating systems - ideally Linux Nice to have skills:   AWS LambdaFamiliarity AirflowExperience with integrating to Bank/Financial Institution API'sBe able to design and implement database pipelinesDevOps experienceHave experience with logging and monitoring data pipelinesExperience with scaling data pipelines for large datasetsSome exposure to modern big data frameworksGit for version controlPrevious exposure to NoSQL databases such as MongoDBGraph database experienceTesting frameworks. If this role is of any interest, please apply for the role and I will be in touch.  Randstad Technologies Ltd is a leading specialist recruitment business for the IT industry. Please note that due to a high level of applications, we can only respond to applicants whose skills & qualifications are suitable for this position. No terminology  in this advert is intended to discriminate against any of the protected characteristics that fall under the Equality Act 2010. For the purposes of the Conduct Regulations 2003, when advertising permanent vacancies we are acting as an Employment Agency, and  when advertising temporary/contract vacancies we are acting as an Employment Business. ", "Salary": null, "Location": null, "Contract": null}, "40469686": {"Description": " A Private Equity firm that is focused towards the Insurance Industry is looking to a hire a Senior Data Scientist to join the business. The role will transition into a Head of Data Science position as the current incumbent will transition into a CDO. The role will involve working closely with the Head of Data Science as they advise and offer hands on services to their clients. Senior Data Scientist Role:  Help solve large scale data science problems for clientsWork cross-functionally with partners to evaluate use cases, collect data, design solution architectures and build infrastructureDesign, develop and maintain (data-driven) algorithms, models, application programme interfaces (APIs), and applicationsCommunicate solution recommendations to business stakeholders in support of data-driven decision making Senior Data Scientist Requirements:  MSc in Mathematics, Statistics, Engineering, Computer Science or an Applied Science5+ years' experience of data mining, analytics, modelling and predictive software development (scikit-learn/MLlib)5+ years' experience of scripting/programming with the R, Python or Scala languagesProven ability to debug and troubleshoot predictive source code and modelsExperience designing comprehensive data (science) solution architectures and workflowsDemonstrated ability to review/scope business problems, identify effective key performance indicators (KPIs) and define accurate project timelinesExperience with translating data solutions and effectively Desirable:  Experience with distributed computing frameworks (Hadoop/Apache Spark)Experience using the Amazon Web Services (AWS) cloud platformExperience using the Databricks analytics platform For more information, please apply to this advert. Thanks  ", "Salary": null, "Location": null, "Contract": null}, "40557100": {"Description": " An exciting opportunity has arisen for a Senior Data Scientist/Machine Learning Engineer to work within a healthcare firm that uses some of the most progressive AI approaches to detect patterns in data to accelerate the development in medicine. The role  is within a collaborative team and would suit someone with a genuine passion for healthcare. Responsibilities will include:  Building and implementing Machine Learning models to provide intelligence to support business decision-makingLooking out for opportunities and tools in the research world that could yield better resultsHelp develop robust model training and data infrastructure to support continuous optimisation of ML-driven approachesWhen required publish research results in national and international conferences and scientific journals Requirements:  PhD degree in Computer Science, Machine Learning or a related quantitative fieldHands-on experience using machine learningExpert coding skills using PythonExperience of analysing clinical/healthcare data is considered a bonus Benefits include company share option scheme, 5% pension, BUPA Health Insurance and free gym membership.", "Salary": null, "Location": null, "Contract": null}, "40537038": {"Description": " Data Scientist, Machine Learning Engineer, AI Our client, an AI R&D company based in Central London are seeking a strong Data Scientist to join their tight nit cross-functional team. As the Data Scientist you will be hands on with our clients Data and product on a daily basis. The key standout skills  where it would be hugely beneficial if you have had experience of working with Natural Language Processing, Python for deploying and developing in a production environment and has a good understanding of BERT and how it transforms. This role offers flexibility  on working arrangements and will start fully remotely due to COVID-19. As the Data Scientist, you will have experience with;  BERT, GPT2 or Other TransformerAI2 NLP LibrarySpacy LibraryAWS SagemakerPytorchTensor Flow It would be beneficial, if the Data Scientist has had experience with as many of the following;  Microsoft LuisGoogle DialogflowRasaAWS LexIBM WatsonCustom Solution If this Data Scientist role looks like its for you, then please apply now! You will be joining a forward - thinking company who are fully committed to making a difference within the Real Estate market and will be working with like-minded and driven individuals. The company believes from promoting from within and offers  the chance for career progression.  Data Scientist, Machine Learning Engineer, AI Referral Scheme: If this role isn’t for you then perhaps you could recommend a friend or colleague to Haybrook IT. If we go on to place that person in a permanent or temporary capacity then you could be rewarded with £500!! Please see our website for terms  and conditions. Haybrook IT Resourcing is Oxford’s leading IT recruitment agency. With exclusive access to some of the region’s most successful companies, send in your CV today to secure your next IT position. Haybrook IT Resourcing Ltd acts as an employment agency and an employment business. We value diversity and always appoint on merit. ", "Salary": null, "Location": null, "Contract": null}, "40477757": {"Description": "Site Name: UK - Hertfordshire - Stevenage, UK - London - Brentford, USA - Pennsylvania - Upper ProvidencePosted Date: Jun 19 2020Our Company GlaxoSmithKline (GSK) is a science-led, global healthcare company, employing over 100,000 people in more than 115 countries. Our mission is to improve the quality of human life by enabling people to do more, feel better, live longer. Data, Methods, & Analytics GSK’s Data, Methods and Analytics team (DMA) partners closely with both the Health Economics and Outcomes Research (HEOR), Real-World Evidence (RWE), and Epidemiology teams to support drug development and patient access. We are an in-house data and analytics  team set up to provide insight into the patterns, burden, and occurrence of disease, cost and healthcare utilisation, and the safety and effectiveness and other outcomes of treatment. Our goal is to provide objective evidence of the value of our medicines  through the analysis of electronic health records, administrative claims, patient registries and other observational health data sources, as well as post-hoc analysis of randomized clinical trial (RCT) data. Roles and Responsibilities Within this role you could:  Transform real-world data (RWD) into actionable insights in Epidemiology and Health Outcomes research through study design and hands-on manipulation and statistical analysis of complex health datasets.Consult and collaborate with research partners to inform, conduct, analyse, interpret and report studies using real world healthcare data.Perform analyses of RCT data to support economic dossiers and market access (i.e., Indirect treatment comparisons, meta-analysis, network meta-analyses, post hoc analysis of RCT data etc.)Represent DMA as a subject matter expert on real world data, its use incl. study methodologies and capabilities.Investigate, critically appraise and apply innovative methods, technologies and tools to better leverage real world data.Explore novel ways to refine and streamline routine analytics through the development and application of robust approaches. Basic Qualifications To succeed in this role, you should:  Hold a Master’s degree or PhD, or have equivalent experience, in a quantitative discipline such as statistics, epidemiology, health economics, health services research, or biostatisticsBe passionate about working hands-on with data, and proficient in manipulating large, complex datasets in a statistical programming language such as SAS, R or StataHave excellent problem-solving and analytical skills and enjoy finding efficient and innovative solutions to challenging problemBe self-reliant with the ability to deliver robust, timely, high-quality analyticsBe an enthusiastic collaborator and enjoy working on a wide range of projects and requests across multiple therapy areasBe an effective communicator and able to articulate complex concepts to diverse audiencesUS or UK Work authorization. Sponsorship not available. Preferred Qualifications If you have the following characteristics, it would be a plus:  Prior experience working with population-based health outcomes data Why GSK? Our values and expectationsare at the heart of everything we do and form an important part of our culture. These include Patient focus, Transparency, Respect, Integrity along with Courage, Accountability, Development, and Teamwork. As GSK focuses on our values and expectations and a culture of innovation, performance, and trust, the successful candidate  will demonstrate the following capabilities:   Agile and distributed decision-making – using evidence and applying judgement to balance pace, rigor and riskManaging individual and team performance.Committed to delivering high quality results, overcoming challenges, focusing on what matters, execution.Implementing change initiatives and leading change.Sustaining energy and well-being, building resilience in teams.Continuously looking for opportunities to learn, build skills and share learning both internally and externally.Developing people and building a talent pipeline.Translating strategy into action - a compelling narrative, motivating others, setting objectives and delegation.Building strong relationships and collaboration, managing trusted stakeholder relationships internally and externally.Budgeting and forecasting, commercial and financial acumen. *LI-GSK If you require an accommodation or other assistance to apply for a job at GSK, please contact the GSK Service Centre at 1-877-694-7547 (US Toll Free) or + (outside US). GSK is an Equal Opportunity Employer and, in the US, we adhere to Affirmative Action principles. This ensures that all qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy,  marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class. Important notice to Employment businesses/ Agencies GSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department  to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such  written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions  or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site. Please note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, GSK may be required to capture and report expenses GSK incurs, on your behalf, in the event you are afforded  an interview for employment. This capture of applicable transfers of value is necessary to ensure GSK’s compliance to all federal and state", "Salary": null, "Location": null, "Contract": null}, "40517734": {"Description": " Data Science Manager - UK Insurer - London - Perm Fantastic opportunity for a commercially focused Data Scientist to join a leading UK insurance business at the forefront of their market. Working with a business where employees and customers are always at the core of their values and practices, you will  be offered excellent opportunities to develop and progress your career, alongside a competitive salary and benefits package. Job Description Working within a cutting-edge data science department of a market leading insurer, you will lead a small but growing team to successfully deliver the company's marketing and pricing strategy. This will be a commercially focused role where you are leading  a team of data scientists using advanced machine learning techniques, and ensuring the business is staying ahead of the curve within the sector, to deliver strategic goals. Your duties as a data science manager will include but not be limited to the following:  Be a key contributor to the on-going development and implementation of the overall data science strategy.Lead a team of data scientists to achieve the business' objectives across both pricing and marketingEvolve and continuously improve the company's pricing and marketing models using advanced analytic and machine learning techniques.Deliver comprehensive pricing analyses and modelling projects using machine learning and data science techniques.Be able to analyse, communicate and explain pricing and marketing optimisation in a way that will influence key stakeholders from across the business. Monitor performance, profitability and competitor behaviour to help hit business targets.Being motivated, curious data scientist finding business value from data.  Be an advocate for data science across internal and external stakeholders, being a thought leader for data science. The Successful Data Science Manager I am looking for an innovative and forward-thinking Data Scientist, with experience using advanced machine learning techniques within a large-scale business, or for a consultancy working with commercial clients. It is paramount that you have a passion for  using data science to achieve commercial goals. Your technical skills will include extensive use of tools such as Python, R, and SQL, as well as being a superb data wrangler. If you also have any experience within insurance pricing, and have used tools such Earnix and Datarobot, that will be a big plus,  however these are not essential. It is imperative that you have experience the development of others as this role will be managing 4 at first, with this number set to grow. You must be a first class communicator with the ability to confidently present to senior stakeholders, and have the ability to explain the 'so what' of complex data to non-technical audiences. What's on Offer for the successful Data Science Manager Competitive base salary depending on experience, coupled with an excellent benefits package and bonus. ", "Salary": null, "Location": null, "Contract": null}, "40460777": {"Description": " Data Science Consultant / Data Scientist Asset ManagementLondon£60,000 + Bonus THE COMPANY This is a unique chance to join a brand new team being set up in a leading asset management firm based in London. You will be a key member brought in to build a team who will focus on building data science products to support the wider business, everything from sales functions to internal investment processes. You will have the remit to build something which has never been done in the industry, as well as work with a great team of data scientists, engineers and analysts! THE ROLE You will be:  Utilising advanced analytics to build products and internal tools for the wider businessBuild an internal recommendation system to generate and keep business.Using data science techniques to understand customer behaviour and marketingLiaising with senior stakeholders Delivering effective analytics and visualisations for internal use YOUR SKILLS AND EXPERIENCE You must have:  An MSc in a statistical or engineering degreeExperience in programming languages such as R or PythonExperience in SQL is beneficialA proven track record of delivering business insights and supporting strategic decisions through the use of data scienceA can-do attitude and a passion for solving a range of complex problems with data! THE BENEFITS £60,000 + Benefits (including bonus) HOW TO APPLY Please register your interest by sending your CV via the Apply link on this page. KEYWORDS Python, R, SQL, Data Science, Data Scientist, Machine Learning.  ", "Salary": null, "Location": null, "Contract": null}, "40475134": {"Description": " Data Science ManagerLondon (Zone 1)£85,000 - £95,000THE COMPANYHarnham are currently partnering with a global tech company who are currently hiring for a Data Science Manager to join the business.  You will join a global team of Data Scientists, Engineers and Analysts spread across London, San Francisco, and Stockholm. THE ROLEYou will be expected to:  Manage and mentor a growing team of Data ScientistsLead a variety of projects related to customer behaviour, marketing effectiveness and campaigns. Collaborate closely with research, product and commercial teams to deliver real-time machine learning at scale.Introduce new and interesting ways to work with data to keep the business at the forefront of innovation within data science. YOUR SKILLS AND EXPERIENCEYou must have:  An MSc or Ph.D. in a quantitative discipline (e.g. statistics, physics, mathematics)Several years of demonstrated machine learning experience to solve a wide array of commercial problemsEnd to end problem solving experienceStrong knowledge of Python or R, and SQL THE BENEFITS~ £95,000 + BenefitsHOW TO APPLYPlease register your interest by sending your CV via the Apply link on this page. For more information about this role, or similar machine learning positions, please get in touch with Nick Mandella at Harnham. KEYWORDSPython, Machine learning, data scientist, data science, customer behaviour, marketing analytics.  ", "Salary": null, "Location": null, "Contract": null}, "40491401": {"Description": " Data Science LeadLondon (Zone 1)£85,000 - £95,000THE COMPANY -Data Science Lead Harnham are currently partnering with a global tech company who are currently hiring for a Data Science Lead to join the business.  You will join a global team of Data Scientists, Engineers and Analysts spread across London, San Francisco, and Stockholm. THE ROLE -Data Science Lead You will be expected to:  Manage and mentor a growing team of Data ScientistsLead a variety of projects related to customer behaviour, marketing effectiveness and campaigns. Collaborate closely with research, product and commercial teams to deliver real-time machine learning at scale.Introduce new and interesting ways to work with data to keep the business at the forefront of innovation within data science. YOUR SKILLS AND EXPERIENCEYou must have:  An MSc or Ph.D. in a quantitative discipline (e.g. statistics, physics, mathematics)Several years of demonstrated machine learning experience to solve a wide array of commercial problemsEnd to end problem solving experienceStrong knowledge of Python or R, and SQL THE BENEFITS~ £95,000 + BenefitsHOW TO APPLYPlease register your interest by sending your CV via the Apply link on this page. For more information about this role, or similar machine learning positions, please get in touch with Nick Mandella at Harnham. KEYWORDSPython, Machine learning, data scientist, data science, customer behaviour, marketing analytics.  ", "Salary": null, "Location": null, "Contract": null}, "40460821": {"Description": " Machine Learning Engineer (Remote)London£40,000+ THE COMPANY Harnham are working with a very exciting online marketplace in the UK right now who are currently looking for a Machine Learning Engineer to join their data science function. You will join a team of 10 data scientists responsible for work in recommender systems, customer behaviour and product optimisation. You will be required to work on production-level machine learning problems, and be able to also excel in areas of data engineering and software engineering too. Part of your role will also be to drive the use of cutting-edge methodologies for the business. Tech stack: Python & Spark. YOUR SKILLS AND EXPERIENCE You must have:  An MSc or Ph.D. in Machine Learning, Statistics, Computer Science, Artificial Intelligence or MathematicsA broad range of data science skills and variety of technical proficienciesProficiency in a variety of machine learning techniques THE BENEFITS £40,000 +  HOW TO APPLY Please register your interest by sending your CV via the Apply link on this page. CONTACT Please contact Nick Mandella at Harnham for more information. KEYWORDS Python, SQL, Spark, Machine Learning, Recommender, Recommendation System, Research, Customer, Insight, Marketing, Product, Online, Data Scientist, Data Science, Predictive modelling, Forecasting. ", "Salary": null, "Location": null, "Contract": null}, "40568589": {"Description": " Data Science Senior ManagerLondon£100,000 - £110,000 + disc. bonusTHE ROLE: A global telco is looking for a Senior Data Science Manager to join their business to help build a brand new Data Science function in London. You will form a team focused on bringing machine learning best-practice into the business to help monetise existing data in new ways - building data science products for 3rd parties and having a direct impact on PnL. This is a pivotal role and you will be expected to manage a small Data Scientists and Data Engineers. You will also work on some interesting covid-19 related projects involving analysing real-time location data. WHAT YOU NEED:  A deep knowledge of both supervised and unsupervised machine learning techniquesA wealth of experience in the application of machine learning to solve complex business problemsTeam leadership experienceStrong communication skillsAn MSc or equivalent in a statistical/quantitative subejctStrong skills in Python and SQLExperience in using GCP is a bonusA track record in using machine learning to draw hidden insights from data THE BENEFITSYou can earn up to £110,000 + bonus + benefits in this position. HOW TO APPLYTo be considered for this exciting opportunity, please submit your details using the Apply button on this page. For more information about similar roles please contact Nick Mandella at Harnham. KEYWORDS Python, SQL, GCP, AWS, Data Scientist, Data Science, Machine Learning, Supervised Learning, Unsupervised Learning, Telco, Data, Analyst, Analysis, London. ", "Salary": null, "Location": null, "Contract": null}, "40509921": {"Description": " Data Science Senior ManagerLondon£100,000 - £110,000 + disc. bonusTHE ROLE: A global telco is looking for a Senior Data Science Manager to join their business to help build a brand new Data Science function in London.  You will form a team focused on bringing machine learning best-practice into the business to help monetise existing data in new ways - building data science products for 3rd parties and having a direct impact on PnL.  This is a pivotal role and you will be expected to manage a small Data Scientists and Data Engineers. You will also work on some interesting covid-19 related projects involving analysing real-time location data. WHAT YOU NEED:  A deep knowledge of both supervised and unsupervised machine learning techniquesA wealth of experience in the application of machine learning to solve complex business problems Team leadership experienceStrong communication skillsAn MSc or equivalent in a statistical/quantitative subejctStrong skills in Python and SQLExperience in using GCP is a bonusA track record in using machine learning to draw hidden insights from data THE BENEFITSYou can earn up to £110,000 + bonus + benefits in this position. HOW TO APPLYTo be considered for this exciting opportunity, please submit your details using the Apply button on this page. For more information about similar roles please contact Nick Mandella at Harnham. KEYWORDS R, Python, SQL, GCP, AWS, Data Scientist, Data Science, Machine Learning, Supervised Learning, Unsupervised Learning, Telco, Data, Analyst, Analysis, London. ", "Salary": null, "Location": null, "Contract": null}}